Repository: JarLob/CrypTool2
Catalog: CrypPlugins/FriedmanTest/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginCaption
source: Friedman Test
zh_cn: 弗里德曼检验

# PluginTooltip
source: Calculates the probable key lenght of a polyalphabetic substitution cipher.
de: Berechnet die wahrscheinliche Schlüssellänge einer polyalphabetischen Substitutions-Verschlüsselung
zh_cn: 计算多字母替换密码的可能密钥长度

# StringOutputCaption
source: Results
de: Ergebnisse
zh_cn: 结果

# StringOutputTooltip
source: This ouput provides the results of the Friedman test \nas key/value pairs, one per each line.
de: Hier werden die Ergebnisse des Friedman-Tests zeilenweise als Schlüssel/Wert-Paare ausgegeben.
zh_cn: 此输出以键/值对的形式提供Friedman检验的结果，每行一个。

# KeyLengthCaption
source: Probable key length value.
de: Wahrscheinliche Schlüssellänge
zh_cn: 可能的密钥长度值。

# KeyLengthTooltip
source: This value gives the probable key length of the analyzed text.
de: Dies ist die wahrscheinliche Schlüssellänge des analysierten Textes.
zh_cn: 该值给出了分析文本的可能密钥长度。

# KappaCiphertextCaption
source: Index of coincidence (IC)
de: Koinzidenzindex
zh_cn: 符合指数（IC）

# KappaCiphertextTooltip
source: This output provides the calculated index of coincidence of the provided \noccurences of letters (frequency analysis).
de: Hier wird der für die angegebenen Buchstabenhäufigkeiten berechnete Koinzidenzindex ausgegeben.
zh_cn: 此输出提供所提供的字母出现次数（频率分析）的计算出的一致性索引。

# ArrayInputCaption
source: Letter count input
de: Eingabe der Buchstabenhäufigkeiten
zh_cn: 字母计数输入

# ArrayInputTooltip
source: This input accepts a list (array) with the absolute number of letter \noccurences in an encrypted text. This list can be generated e.g. with the frequency test.
de: Hier wird eine Liste der absoluten Buchstabenhäufigkeiten eines Textes eingegeben. Diese kann z.B. mit dem FrequencyTest-Plugin erzeugt werden.
zh_cn: 此输入接受一个列表（数组），该列表具有加密文本中字母出现的绝对数量。该列表可以通过例如频率测试生成。

# KappaCaption
source: Kappa plain-text
de: Kappa des Klartextes
zh_cn: Kappa纯文本

# KappaTooltip
source: Select the language to be analysed
de: Wählen Sie die zu analysierende Sprache.
zh_cn: 选择要分析的语言

# KappaList1
source: English
de: Englisch
zh_cn: 英语

# KappaList2
source: German
de: Deutsch
zh_cn: 德语

# KappaList3
source: French
de: Französisch
zh_cn: 法文

# KappaList4
source: Spanish
de: Spanisch
zh_cn: 西班牙文

# KappaList5
source: Italian
de: Italienisch
zh_cn: 义大利文

# KappaList6
source: Portuguese
de: Portugiesisch
zh_cn: 葡萄牙语
