Repository: JarLob/CrypTool2
Catalog: CrypPlugins/VisualEncoder/Properties/Resources.*.resx
Languages: ru, zh_cn

# AppendICVCaption
source: Append Checksum
ru: Добавить контрольную сумму
zh_cn: 附加校验和

# BarcodeSection
source: properties of barcode
ru: свойства штрих-кода
zh_cn: 条码的属性

# C128_ICV_DISC
source: The ICV is calculated from a weighted sum (modulo 103) of all the characters.
ru: ICV вычисляется из взвешенной суммы (по модулю 103) всех символов.
zh_cn: 根据所有字符的加权和（模103）来计算ICV。

# C128_ICV_LABLE
source: Integrity Check Value
ru: Значение проверки целостности
zh_cn: 完整性检查值

# C128_STARTEND_DISC
source: There are three distinct start patterns that determine in which way the code was encoded. However, the end pattern is always the same
ru: Существует три разных шаблона запуска, которые определяют, каким образом кодируется код. Однако конечный шаблон всегда один и тот же.
zh_cn: 有三种不同的开始模式，用于确定代码的编码方式。但是，结束模式始终相同。

# C128_STARTEND_LABLE
source: Start and End Pattern
ru: Начальный и конечный паттерн
zh_cn: 开始和结束模式

# C38_ICV_DISC
source: The ICV is calculated from a weighted sum (modulo 43) of all the characters.
ru: ICV рассчитывается из взвешенной суммы (по модулю 43) всех символов.
zh_cn: 根据所有字符的加权和（模43）计算ICV。

# C38_ICV_LABLE
source: Integrity Check Value
ru: Значение проверки целостности
zh_cn: 完整性检查值

# C38_STARTEND_DISC
source: The Start and End Symbol is a '*'. With the aid of the symbol, the code can be read reliably, even if it is read backwards.
ru: Символ «Начало и конец» - это «*». С помощью символа код можно считывать надежно, даже если он считывается назад.
zh_cn: 起始和结束符号为“ *”。借助符号，即使向后读取代码，也可以可靠地读取代码。

# C38_STARTEND_LABLE
source: Start and End Symbol
ru: Символ начала и конца
zh_cn: 开始和结束符号

# DimCodeLabel
source: Visual code
ru: Визуальный код
zh_cn: 可视代码

# DM_ALIG_DISC
source: The alignment pattern is static. It enables to read the code at every alignment.
ru: Шаблон выравнивания статический. Он позволяет считывать код при каждом выравнивании.
zh_cn: 对齐方式是静态的。它使您能够在每次对齐时读取代码。

# DM_ALIG_LABLE
source: Alignment Detection
ru: Обнаружение выравнивания
zh_cn: 对准检测

# DM_COLUMNID_DISC
source: This pattern helps the reader to easily find the different data column in the code.
ru: Этот шаблон помогает читателю легко найти столбец данных в коде.
zh_cn: 这种模式可以帮助读者轻松地找到代码中的不同数据列。

# DM_COLUMNID_LABLE
source: Column Identificator
ru: Идентификатор столбца
zh_cn: 列标识符

# EAN13_FIXED_DISC
source: The fixed Bars are mainly orientations points for the reader. In fact, the reader needs to know when it’s at the middle of the code, because the encoding changes at that point
ru: Фиксированные бары - это, в основном, ориентиры для читателя. Они необходимы, потому что в этих точках меняется кодировка.
zh_cn: 固定条主要是读者的方向点。它们是必需的，因为编码在这些点上会发生变化。

# EAN13_FIXED_LABLE
source: Fixed Reference Point
ru: Исправлена ​​контрольная точка
zh_cn: 固定参考点

# EAN13_ICV_DISC
source: The checksum is calculated taking a varying weight value times the value of each number in the barcode to make a sum (modulo 10).
ru: Контрольная сумма рассчитывается с использованием переменной величины веса, умноженной на значение каждого номера в штрих-коде, чтобы сделать сумму (по модулю 10).
zh_cn: 校验和的计算方法是将权重值乘以条形码中每个数字的值，然后求和（取模10）。

# EAN13_ICV_LABLE
source: Integrity Check Value
ru: Значение проверки целостности
zh_cn: 完整性检查值

# EAN8_FIXED_DISC
source: The fixed Bars are mainly orientations points for the reader. In fact, the reader needs to know when it’s at the middle of the code, because the encoding changes at that point
ru: Фиксированные бары - это, в основном, ориентиры для читателя. Они необходимы, потому что в этих точках меняется кодировка.
zh_cn: 固定条主要是读者的方向点。它们是必需的，因为编码在这些点上会发生变化。

# EAN8_FIXED_LABLE
source: Fixed Reference Point
ru: Исправлена ​​контрольная точка
zh_cn: 固定参考点

# EAN8_ICV_DISC
source: The checksum is calculated taking a varying weight value times the value of each number in the barcode to make a sum (modulo 10).
ru: Контрольная сумма рассчитывается с использованием переменной величины веса, умноженной на значение каждого номера в штрих-коде, чтобы сделать сумму (по модулю 10).
zh_cn: 校验和的计算方法是将权重值乘以条形码中每个数字的值，然后求和（取模10）。

# EAN8_ICV_LABLE
source: Integrity Check Value
ru: Значение проверки целостности
zh_cn: 完整性检查值

# ExplainLabel
source: Explanation
ru: объяснение
zh_cn: 说明

# QR_ALIG_DISC
source: The alignment pattern is static. It enables to read the code at every alignment.
ru: Шаблон выравнивания статический. Он позволяет считывать код при каждом выравнивании.
zh_cn: 对齐方式是静态的。它使您能够在每次对齐时读取代码。

# QR_ALIG_LABLE
source: Alignment Detection
ru: Обнаружение выравнивания
zh_cn: 对准检测

# CODE39_INVALIDE_INPUT
source: Invalide Input
zh_cn: 无效输入

# PDF417_ROWID_DISC
source: This pattern helps the reader to easily find the different data rows in the code.
ru: Этот шаблон помогает читателю легко находить разные строки данных в коде.
zh_cn: 这种模式可以帮助读者轻松地找到代码中的不同数据行。

# PDF417_ROWID_LABLE
source: Row Identificator
ru: Идентификатор строки
zh_cn: 行标识符

# PDF417_SEPAT_DISC
source: With the aid of the pattern, the code can be read reliably, even if it is read upside down or backwards.
ru: С помощью шаблона код можно считывать надежно, даже если он считывается с ног на голову или назад.
zh_cn: 借助该模式，即使颠倒或反向读取代码，也可以可靠地读取代码。

# PDF417_SEPAT_LABLE
source: Start and End Pattern
ru: Начальный и конечный паттерн
zh_cn: 开始和结束模式

# QR_FORMAT_DISC
source: Here among others, is the Error Correction Level determined. This indicates what percentage of the code (7% - 30%) can be recovered in case of damage
ru: Здесь, среди прочих, определяется уровень коррекции ошибок. Это указывает, какой процент от кода (7% - 30%) можно восстановить в случае повреждения.
zh_cn: 在此，确定纠错等级。这表明在损坏的情况下可以恢复多少百分比的代码（7％-30％）。

# QR_FORMAT_LABLE
source: Format Informations
ru: Информация о формате
zh_cn: 格式信息

# QR_VERSION_DISC
source: The version specifies one of 40 pre- defined sizes for the QR code.
ru: Версия определяет один из 40 предопределенных размеров для QR-кода.
zh_cn: 该版本指定QR码的40种预定义尺寸之一。

# QR_VERSION_LABLE
source: Version Informations
ru: Информация о версии
zh_cn: 版本信息

# QR_NORMAL_DISC
source: In this area, the data is shown redundant, so that it can be read reliably even if pieces of code are covered or damaged.
ru: В этой области данные показаны избыточными, поэтому их можно считывать надежно, даже если фрагменты кода покрыты или повреждены.
zh_cn: 在该区域中，数据显示为冗余，因此即使代码段被覆盖或损坏，也可以可靠地读取它们。

# QR_NORMAL_LABLE
source: Data
ru: Данные
zh_cn: 数据

# EAN_INVALIDE_INPUT
source: The input contains invalid characters. Only Digits are allowed.
ru: Ввод содержит недопустимые символы. Разрешены только цифры.
zh_cn: 输入包含无效字符。仅允许数字。
