Repository: JarLob/CrypTool2
Catalog: CrypPlugins/ImageSteganographyVisualization/Properties/Resources.*.resx
Languages: de, zh_cn

# ActionCaption
source: Action
de: Aktion
zh_cn: 行动

# ActionList1
source: Hide
de: Verstecken
zh_cn: 隐藏

# ActionList2
source: Extract
de: Extrahieren
zh_cn: 提取

# ActionTooltip
source: Choose an action
de: Wählen Sie eine Aktion aus
zh_cn: 选择一个动作

# ApplyButton
source: Apply
de: übernehmen
zh_cn: 应用

# ApplyChangesButton
source: Apply changes
de: Änderungen übernehmen
zh_cn: 应用更改

source: Back to main menu
de: Zurück zum Hauptmenu
zh_cn: 返回主菜单

# BitmaskTooltip
source: Choose a bitmask that defines which bits should be used for the hiding process
de: Wählen Sie die Bitmaske aus, die definiert welche Bits für das Verstecken benutzt werden sollen
zh_cn: 选择一个位掩码，该位掩码定义隐藏过程应使用哪些位

# BitsAfterLabel
source: RGB bits after
de: RGB Bits nachher
zh_cn: 之后的RGB位

# BitsBeforeLabel
source: RGB bits before
de: RGB Bits vorher
zh_cn: RGB位之前

# BitsChosenLabel
source: Number of bits chosen to hide the secret message:
de: Anzahl der ausgewählten Bits, die für das Verstecken der Nachricht angewendet werden:
zh_cn: 选择隐藏秘密消息的位数：

# BlueBitMaskLabel
source: Blue bitmask
de: Blau Bitmaske
zh_cn: 蓝色位掩码

# BluePBLabel
source: Blue bit planes
de: Blaue Bitebenen
zh_cn: 蓝位飞机

# BlueValueLabel
source: Blue value:
de: Blau Wert:
zh_cn: 蓝色值：

# BPCSMainMenu1
source: Understand how the algorithm works
de: Wie der Algorithmus funktioniert
zh_cn: 无法理解算法的工作原理

# BPCSMainMenu2
source: See hiding process
de: Versteckprozess ansehen
zh_cn: 查看隐藏过程

# BPCSMainMenu3
source: See pixel conversion
de: Pixelkonvertierung ansehen
zh_cn: 查看像素转换

# BPCSMainMenu4
source: See different bit planes
de: Unterschiedliche Bitebenen ansehen
zh_cn: 查看不同的位平面

# ChooseBitsButton
source: Choose other bits
de: andere Bits auswählen
zh_cn: 选择其他位

# ChooseBitsViewText1
source: Click on the bits that should be used to hide the message bits
de: Wählen Sie die Bits aus, die für das Verstecken der Nachrichtenbits benutzt werden sollen
zh_cn: 单击应用于隐藏消息位的位

# ChooseBitsViewTitle
source: Choose Bits View
de: Bits für das Verstecken auswählen
zh_cn: 选择位视图

# ColorOrderCaption
source: Color order
de: Farbensortierung
zh_cn: 颜色顺序

# ColorOrderTooltip
source: Select with help of the different possible color ordering, how the bit planes should be ordered
de: Wählen Sie mithilfe der unterschiedlichen Farbensortierung aus, nach welcher Reihenfolge die Bitebenen sortiert werden sollen
zh_cn: 借助不同的可能的颜色顺序选择位平面应如何排序

# ComplexityCaption
source: Complexity Threshold
de: Komplexitätsgrenzwert
zh_cn: 复杂度阈值

# ComplexityLabel
source: Complexity:
de: Komplexität:
zh_cn: 复杂：

# ComplexityTooltip
source: Select a threshold for the complexity value, which is used to determine whether a block is complex or not. This value should be between 0 and 1
de: Bestimmen Sie den Grenzwert für die Komplexität, der bestimmt ob ein Block komplex oder nicht ist. Dieser Wert soll zwischen 0 und 1 liegen
zh_cn: 选择复杂度值的阈值，该阈值用于确定块是否复杂。此值应介于0和1之间

# ConjugatedLabel
source: Conjugated:
de: Konjugiert:
zh_cn: 共轭：

# ConjugationText
source: P is the original message block, Wc is the checkboard pattern which increases the complexity, and P* is the conjugated version of the message block P.
de: P ist der originale Nachrichtenblock, Wc ist das Schachbrettmuster was dem Erhöhen der Komplexität dient, P* ist die konjugierte Version des Nachrichtenblocks P.
zh_cn: P是原始消息块，Wc是增加复杂度的棋盘图案，P *是消息块P的共轭版本。

# ConversionViewText1
source: The hiding procedure is now done, you can see the ouput image in the picture output component.
de: Das Verstecken ist jetzt nun abgeschlossen, Sie können das Ergebnis im Bildausgabe Komponente.
zh_cn: 隐藏过程现已完成，您可以在图片输出组件中看到输出图像。

# ConversionViewText2
source: You can see the conversion of the pixels by entering the x and y coordinates in the text box below, or by using the arrows to browse through the pixels.
de: Sie können die Konvertierung in den Pixeln sehen, indem Sie die x- und y-Koordinaten des Pixels in das Textfeld unten eingeben, oder mittels den Pfeilen um die Pixels zu browsen.
zh_cn: 您可以通过在下面的文本框中输入x和y坐标或使用箭头浏览像素来查看像素的转换。

# CurrentComplexBlockNrLabel
source: Current complex block number:
de: Nummer des aktuellen complexen Bildblocks:
zh_cn: 当前的复杂块号：

# CurrentImageBlockNrLabel
source: Current image block number:
de: Nummer des aktuellen Bildblocks:
zh_cn: 当前图像块号：

# CurrentMessageBlockNrLabel
source: Current message block numer:
de: Nummer des aktuellen Nachrichtenblocks:
zh_cn: 当前消息块编号：

# CurrentPixelLabel
source: Current pixel
de: Aktuelles Pixel
zh_cn: 当前像素

# GreenBitMaskLabel
source: Green bitmask
de: Grün Bitmaske
zh_cn: 绿色位掩码

# GreenPBLabel
source: Green bit planes
de: Grüne Bitebenen
zh_cn: 绿位飞机

# GreenValueLabel
source: Green value:
de: Grün Wert:
zh_cn: 绿色价值：

# HiderBlocksPanelText1
source: Image block on the right is replaced with the message block on the left
de: Der Bildblock rechts ist mit dem Nachrichtenblock links ersetzt
zh_cn: 右侧的图像块被左侧的消息块替换

# HidingAndCapacityTitle
source: Overview and Hiding Capacity Information
de: Übersicht und Kapazitätsinformationen
zh_cn: 概述和隐藏容量信息

# HidingCapacityText
source: Hiding capacity:
de: Versteckkapazität:
zh_cn: 隐藏容量：

# HidingProcessViewTitle
source: Hiding Process
de: Versteckprozess
zh_cn: 隐藏过程

# HintPrompt
source: Hint: Start the program with the "Play" button in the ribbon bar. This enables the button "Choose bits" above.
de: Hinweis: Starten Sie das Programm mit dem "Starten" Button in der Multifunktionsleiste. Dies aktiviert den Button "Bits für den Versteckprozess auswählen" oben.
zh_cn: 提示：使用功能区栏中的“播放”按钮启动程序。这将启用上面的“选择位”按钮。

# HintPrompt2
source: Choose the hiding bits in order to perform the hiding process and activate the other views.
de: Wählen Sie die Bits, die für das Verstecken benutzt werden sollen, um den Versteckprozess abzuschließen und die anderen Views zu aktivieren.
zh_cn: 选择隐藏位以执行隐藏过程并激活其他视图。

# HintPrompt3
source: Hint: Start the program with the "Play" button in the ribbon bar. This executes the hiding process and enables the buttons to access the other views.
de: Hinweis: Starten Sie das Programm mit dem "Starten" Button in der Multifunktionsleiste. Dies führt den Versteckprozess aus und aktiviert die Buttons um auf die anderen Ansichten zuzugreifen.
zh_cn: 提示：使用功能区栏中的“播放”按钮启动程序。这将执行隐藏过程，并使按钮可以访问其他视图。

# ImageBlocksInfoText1
source: Total number of image blocks:
de: Anzahl Bildblöcke insgemat:
zh_cn: 图像块总数：

# ImageBlocksInfoText2
source: Number of complex image blocks:
de: Anzahl komplexe Bildblöcke:
zh_cn: 复杂图像块的数量：

# ImageHeightLabel
source: Image height:
de: Bildhöhe:
zh_cn: 影像高度：

# ImageInfoLabel
source: Image information:
de: Bildinformatonen
zh_cn: 图片信息：

# ImageWidthLabel
source: Image width:
de: Bildbreite:
zh_cn: 图片宽度：

# InputImageCaption
source: Image input
de: Bildeingabe
zh_cn: 影像输入

# InputImageTooltip
source: Upload an image in which the secret message should be hidden or from which the secret message should be extracted
de: Laden Sie ein Bild hoch, das zum Verstecken der Nachricht benutzt werden soll, oder aus dem die Nachricht extrahiert werden soll.
zh_cn: 上载应该隐藏秘密消息或从中提取秘密消息的图像

# InputMessageCaption
source: Message input
de: Nachrichteneingabe
zh_cn: 留言输入

# InputMessageTooltip
source: Enter a text which you want to hide in an image
de: Geben Sie die geheime Nachricht ein, die im Bild versteckt werden soll
zh_cn: 输入要隐藏在图像中的文本

# Intro0Text1
source: Steganography is the procedure of hiding secret data inside non-secret files to conceal the fact that a secret message is being communicated.
de: Steganographie ist das Verfahren zum Verstecken geheimer Daten in nicht-geheimen Dateien, um die Tatsache zu verbergen, dass eine geheime Nachricht übermittelt wird.
zh_cn: 隐秘术是将秘密数据隐藏在非秘密文件中以掩盖正在传达秘密消息这一事实的过程。

# Intro0Text2
source: The term combines the greek words steganós which means hidden and graph which means writing.
de: Der Begriff kombiniert die griechischen Wörter steganós, was versteckt bedeutet, und graph, was Schreiben bedeutet.
zh_cn: 该术语结合了希腊单词steganós（意味着隐藏）和图形（graph）（意味着书写）。

# Intro0Text3
source: The procedure aims to encode data in a way that is so subtle such that the changes cannot be noticed.
de: Die Prozedur codiert Daten auf eine Weise, die so subtil ist, dass die Änderungen nicht bemerkt werden können.
zh_cn: 该过程旨在以一种微妙的方式对数据进行编码，以使更改不会被注意到。

# Intro0Text4
source: Steganogrphy can be combined with cryptography to add an additional layer of security when communicating sensitive data.
de: Steganographie kann mit Kryptographie kombiniert werden, um mehr Sicherheit zu gewährleisten bei vertraulichen Daten.
zh_cn: 隐写术可以与加密技术结合使用，以在传递敏感数据时增加额外的安全性。

# Intro1Text1
source: This diagram shows how the steganography procedure normaly works over an insecure communication channel.
de: Dieses Diagramm zeigt, wie das Steganographie Verfahren normalerweise über einen unsicheren Kommunikationskanal funktioniert.
zh_cn: 此图显示了隐秘程序通常如何在不安全的通信通道上工作。

# Intro1Text2
source: The secret message can be encrypted (ciphertext) or plaintext.
de: Die geheime Nachricht kann verschlüsselt (Geheimtext) oder Klartext sein.
zh_cn: 秘密消息可以是加密的（密文）或明文。

# Intro2BPCSText1
source: BPCS algorithm was introduced to overcome the shortcomings of traditional steganography techniques with limited data hiding capacity. This technique can hide up to 50% of the cover image data amount without much distortion in the visual appearance of the original image.
de: Der BPCS-Algorithmus wurde eingeführt, um die Mängel traditioneller Steganografietechniken mit begrenzter Kapazität zum Verstecken von Daten zu überwinden. Diese Technik kann bis zu 50% der Datenmenge von dem Coverbild verstecken, ohne dass die visuelle Erscheinung des Originalbilds stark verzerrt wird.
zh_cn: 为了克服传统隐写技术的数据隐藏能力有限的缺点，引入了BPCS算法。该技术可以隐藏多达50％的封面图像数据量，而不会在原始图像的视觉外观上造成很大的失真。

# Intro2BPCSText2
source: In BPCS, a multi-valued image consisting of 24-bit pixels can be decomposed into a set of 24 binary pictures (bit planes).
de: In BPCS kann ein mehrwertiges Bild, das aus 24-Bit-Pixeln besteht, in einen Satz von 24 Binärbildern (Bitebenen) zerlegt werden.
zh_cn: 在BPCS中，可以将由24位像素组成的多值图像分解为24个二进制图片（位平面）的集合。

# Intro2BPCSText3
source: These planes are divided into 8 x 8 pixel blocks, the blocks are then classified into noise like regions and informative regions,
de: Diese Ebenen sind in 8 × 8-Pixelblöcke unterteilt, die Blöcke werden dann in Noise-like Regionen und informative Regionen klassifiziert,
zh_cn: 这些平面被划分为8 x 8像素块，然后将这些块分为噪声类区域和信息性区域，

# Intro2BPCSText4
source: Noise like regions (complex regions) can be replaced with 8 x 8 bit blocks of the secret message which should also be complex. If the message block is not complex it should be conjugated to keep the complexity level of the image block,
de: Noise-like Regionen (komplexe Regionen) können durch 8 x 8-Bit-Blöcke der geheimen Nachricht ersetzt werden, die ebenfalls komplex sein sollten. Wenn der Nachrichtenblock nicht komplex ist, sollte er konjugiert werden, um den Komplexitätsgrad des Bildblocks beizubehalten,
zh_cn: 可以将噪声类似的区域（复杂区域）替换为秘密消息的8 x 8位块，该块也应该是复杂的。如果消息块不复杂，则应对其进行缀合以保持图像块的复杂度，

# Intro2BPCSTitle
source: BPCS Algorithm
de: BPCS-Algorithmus
zh_cn: BPCS算法

# Intro2LSBText1
source: In the LSB algorithm, the bits of the secret message replace the least significant bits (LSB) of the pixel bits of the input cover image.
de: In dem LSB-Algorithmus ersetzen die Bits der geheimen Nachricht die niedrigstwertigen Bits (LSB) der Pixelbits des Eingabebildes.
zh_cn: 在LSB算法中，秘密消息的位替换输入封面图像的像素位的最低有效位（LSB）。

# Intro2LSBText2
source: Changing the LSB of a pixel's red, blue and green channels results in a difference that is almost impossible to detect with the naked eye, therefore there would be no suspicion that a secret message is hidden in the image.
de: Das Ändern des LSB der roten, blauen und grünen Kanäle eines Pixels führt zu einem Unterschied, der mit bloßem Auge kaum zu erkennen ist. Daher besteht kein Verdacht, dass eine geheime Nachricht im Bild verborgen ist.
zh_cn: 更改像素的红色，蓝色和绿色通道的LSB会导致用肉眼几乎无法察觉的差异，因此不会怀疑秘密信息隐藏在图像中。

# Intro2LSBText3
source: Example: encoding the message bits 111 in the following pixel:
de: Beispiel: Codieren der Nachrichtenbits 111 im folgenden Pixel:
zh_cn: 示例：在以下像素中编码消息位111：

# Intro2LSBTitle
source: LSB Algorithm
de: LSB Algorithmus
zh_cn: LSB算法

# Intro3BPCSTitle
source: Noise-like vs. Informative Regions Examples
de: Noise-like vs. informative Regionen Beispiele
zh_cn: 类噪声与信息区域的示例

# Intro3LSBText1
source: This is going to be an interactive visualization where you are able to choose the bits that the secret message bits will replace and see the difference between choosing the MSB and LSB for example.
de: Dies wird eine interaktive Visualisierung sein, in der Sie die Bits auswählen können, die die geheimen Nachrichtenbits ersetzen, und beispielsweise den Unterschied zwischen der Auswahl des MSB und des LSB erkennen können.
zh_cn: 这将是一个交互式可视化，您可以在其中选择秘密消息位将替换的位，并查看选择MSB和LSB之间的区别。

# Intro3LSBText2
source: After choosing the bits and executing the program, you can browse through the pixels and see how the replacing process changed each pixel.
de: Nachdem Sie die Bits ausgewählt und das Programm ausgeführt haben, können Sie die Pixel durchsuchen und sehen, wie sich der Ersetzungsprozess bei jedem Pixel geändert hat.
zh_cn: 选择位并执行程序后，您可以浏览像素并查看替换过程如何更改每个像素。

# Intro3LSBText3
source: The last 3 pixels are used to store information for the extraction process, including: length of the secret message and bits used to encode.
de: Die letzten 3 Pixel werden zum Speichern von Informationen für den Extraktionsprozess verwendet, einschließlich: Länge der geheimen Nachricht und die Bits, die zum Codieren verwendet werden.
zh_cn: 最后3个像素用于存储提取过程的信息，包括：秘密消息的长度和用于编码的位。

# Intro3LSBText4
source: Using only the LSB to hide data, the algorithm can hide up to width * height * 3 bits (minus 72 bits for hiding the header information).
de: Wenn der Algorithmus nur das LSB zum Verstecken von Daten verwendet, kann er bis zu Höhe * Breite * 3 Bits verstecken (minus 72 Bits für die Header Informationen).
zh_cn: 仅使用LSB隐藏数据，该算法最多可以隐藏宽度*高度* 3位（用于隐藏标题信息的负72位）。

# Intro3LSBTitle
source: More Information before We Start
de: Mehr Informationen bevor wir anfangen
zh_cn: 开始之前的更多信息

# Intro4BPCSTitle
source: Conjugation Illustration
de: Konjugation Illustration
zh_cn: 共轭图

# InvalidComplexityThresholdInput
source: Invalid input for complexity threshold, value should be between 0 and 1
de: Ungültige Eingabe für den Komplexitätsgrenzwert, der Wert soll zwischen 0 und 1 liegen
zh_cn: 复杂度阈值输入无效，值应在0到1之间

# InvalidInputPrompt
source: Invalid input, please enter value:
de: Ungültige Eingabe, bitte Wert eingeben:
zh_cn: 输入无效，请输入值：

# LSBMainMenu1
source: Understand how the algorithm works
de: Wie der Algorithmus funktioniert
zh_cn: 了解算法的工作原理

# LSBMainMenu2
source: Choose bits for hiding process
de: Bits für den Versteckprozess auswählen
zh_cn: 选择隐藏过程的位

# LSBMainMenu3
source: See pixel conversion
de: Pixelkonvertierung ansehen
zh_cn: 查看像素转换

# LSBMainMenu4
source: Overview and hiding capacity information
de: Übersicht und Versteckkapazität ansehen
zh_cn: 概述和隐藏容量信息

# MessageBlocksInfoText1
source: Total number of message blocks:
de: Anzahl Nachrichtenblöcke insgesamt:
zh_cn: 消息块总数：

# MessageBlocksInfoText2
source: Message size:
de: Größe der Nachricht:
zh_cn: 讯息大小：

# MessageInfoLabel
source: Message information:
de: Nachrichteninformation
zh_cn: 留言信息：

# MessageLengthExtractLabel
source: Message length:
de: Nachrichtenlänge:
zh_cn: 讯息长度：

# MessageLengthLabel
source: Message length:
de: Nachrichtenlänge:
zh_cn: 讯息长度：

# ModeCaption
source: Mode
de: Modus
zh_cn: 模式

# ModeList1
source: LSB Steganography
de: LSB Steganographie
zh_cn: LSB隐写术

# ModeList2
source: BPCS Steganography
de: BPCS Steganographie
zh_cn: BPCS隐写术

# ModeTooltip
source: Choose a mode
de: Wählen Sie einen Modus aus
zh_cn: 选择一种模式

# NextButton
source: Next
de: Weiter
zh_cn: 下一个

# NoImageLogMessage
source: Please upload an image
de: Laden Sie bitte ein Bild hoch
zh_cn: 请上传图片

# NoPresentationPrompt
source: No presentation to be shown
de: Keine Präsentation die angezeigt werden kann
zh_cn: 没有要显示的演示

# NotEnoughHidingCapacity
source: The hiding capcity is less than the size of the secret message, therefore not the whole message was hidden in the image.
de: Die Versteckkapazität ist geringer als die Größe der geheimen Nachricht, daher wurde nicht die ganze Nachricht versteckt.
zh_cn: 隐藏容量小于秘密消息的大小，因此并非整个消息都隐藏在图像中。

# NoTextLogMessage
source: Please enter a message to hide
de: Geben Sie bitte eine Nachricht zum Verstecken ein
zh_cn: 请输入信息以隐藏

# OutputImageCaption
source: Image output
de: Bildausgabe
zh_cn: 影像输出

# OutputImageTooltip
source: This is the image with secret message encoded
de: Hier wird das Bild ausgegeben, in dem die Nachricht versteckt wurde
zh_cn: 这是带有秘密消息编码的图像

# OutputMessageCaption
source: Message output
de: Extrahierte Nachricht
zh_cn: 讯息输出

# OutputMessageTooltip
source: This is the extracted message
de: Dies ist die Nachricht, die aus dem Bild extrahiert wird
zh_cn: 这是提取的消息

# PercentageCapacityLabel
source: Hiding capacity percentage:
de: Prozentuale Versteckkapazität:
zh_cn: 隐藏容量百分比：

# PixelConversionViewTitle
source: Pixel Conversion
de: Pixelkonvertierung
zh_cn: 像素转换

# PlaneLabel
source: Plane layer:
de: Ebene:
zh_cn: 平面层：

# PluginCaption
source: Image Steganography
de: Bildsteganographie
zh_cn: 图像隐写术

# PluginTooltip
source: Hide a secret message in an image
de: Eine geheime Nachricht in einem Bild verstecken
zh_cn: 在图像中隐藏秘密消息

# PointLabel
source: Point
de: Punkt
zh_cn: 点

# PreviousButton
source: Previous
de: Zurück
zh_cn: 以前

# RedBitMaskLabel
source: Red bitmask
de: Rot Bitmaske
zh_cn: 红色位掩码

# RedPBLabel
source: Red bit planes
de: Rote Bitebenen
zh_cn: 红位飞机

# RedValueLabel
source: Red value:
de: Rot Wert:
zh_cn: 红色值：

# SeePixelConversionButton
source: See pixel conversion
de: Pixel Konvertierung ansehen
zh_cn: 查看像素转换

# SeeSlide4Text
source: see slide 1.4.
de: siehe Folie 1.4.
zh_cn: 请参阅幻灯片1.4。

# SeeSlide5Text
source: see slide 1.5.
de: siehe Folie 1.5.
zh_cn: 请参阅幻灯片1.5。

# ShowAllBlocksButton
source: Show all image blocks
de: Alle Bildblöcke ansehen
zh_cn: 显示所有图像块

# ShowButton
source: show
de: anzeigen
zh_cn: 节目

# ShowHiderBlocksButton
source: Show complex blocks
de: Versteckblöcke ansehen
zh_cn: 显示复杂的方块

# ShowPresentationPrompt
source: To show the presentation here, click on the "Settings" icon above and enable the checkbox "Show presentation". Changing settings is only possible, if the template is stopped.
de: Um die Präsentation hier anzuzeigen, klicken Sie oben auf das Symbol "Einstellungen" und aktivieren Sie das Feld "Präsentation anzeigen". Das Ändern von Einstellungen ist nur möglich, wenn die Vorlage gestoppt ist.
zh_cn: 要在此处显示演示文稿，请单击上方的“设置”图标，然后启用“显示演示文稿”复选框。如果模板已停止，则只能更改设置。

# ShowPresentationSettingsCaption
source: Show presentation
de: Präsentation anzeigen
zh_cn: 显示演示

# ShowPresentationSettingsTooltip
source: Show presentation of the hiding process
de: Präsentation des Versteckprozesses anzeigen
zh_cn: 显示隐藏过程的演示

# SkipIntroButton
source: Skip intro
de: Intro überspringen
zh_cn: 跳过介绍

# StartButton
source: Let's Start
de: Los geht's
zh_cn: 开始吧

# SteganographyLabel
source: Steganography
de: Steganographie
zh_cn: 隐写术

# SteganographyModelLabel
source: Steganography Model
de: Steganographie Model
zh_cn: 隐写术模型

# StegModelUrl
source: images/model_en.png
de: images/model_de.png

# XCoTextArea
source: x coordinate
de: x Koordinate
zh_cn: x坐标

# YCoTextArea
source: y coordinate
de: y Koordinate
zh_cn: 和协调
