Repository: JarLob/CrypTool2
Catalog: CrypPlugins/T310/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginTooltip
source: Historic Cipher Machine used by German Democratic Republic
de: DDR-Chiffriergerät
zh_cn: 德意志民主共和国使用的历史密码机

# InputDataCaption
source: Input data
de: Eingabedaten
zh_cn: 输入数据

# InputDataTooltip
source: Enter plaintext (for encryption) or ciphertext (for decryption)
de: Geben Sie den Klartext (für die Verschlüsselung) oder den Geheimtext (für die Entschlüsselung) ein.
zh_cn: 输入纯文本（用于加密）或密文（用于解密）

# InputKeyCaption1
source: Subkey 1
de: Teilschlüssel 1
zh_cn: 子项1

# InputKeyTooltip1
source: Enter a T-310 subkey as binary data. It needs to be exactly 120 bits (15 bytes) long and its parity must be odd.
de: Geben Sie den T-310-Teilschlüssel 1 als Byte-Array ein. Dieser muss eine Länge von 120 Bit (15 Byte) und eine ungerade Parität haben.
zh_cn: 输入T-310子项作为二进制数据。它必须正好为120位（15字节）长，并且其奇偶校验必须为奇数。

# OutputDataCaption
source: Output data
de: Ausgabedaten
zh_cn: 输出数据

# OutputDataTooltip
source: Resulting ciphertext (when encrypting) or plaintext (when decrypting)
de: Verschlüsselter Geheimtext oder entschlüsselter Klartext
zh_cn: 生成的密文（加密时）或明文（解密时）

# ModeCaption
source: Action
de: Aktion
zh_cn: 行动

# ModeTooltip
source: Do you want the input data to be encrypted or decrypted?
de: Wählen Sie die Betriebsart des Plugins.
zh_cn: 是否要对输入数据进行加密或解密？

# ModeList1
source: Encrypt
de: Verschlüsselung
zh_cn: 加密

# ModeList2
source: Decrypt
de: Entschlüsselung
zh_cn: 解密

# VersionCaption
source: Version of the T-310
de: Version der T-310
zh_cn: T-310的版本

# VersionList1
source: T-310/50 telex encryption
de: T-310/50 Fernschreibchiffriergerät
zh_cn: T-310 / 50电传加密

# VersionList2
source: T-310/51 data encryption
de: T-310/51 Datenchiffriergerät
zh_cn: T-310 / 51数据加密

# VersionTooltip
source: Die T310 was available in the models T-310/50 und T-310/51. Version 50 can only decrypt CCITT-2 encoded characters; version 51 any data.
de: Die T-310 gibt es in den Ausführungen T-310/50 und T-310/51. Die Version 50 kann nur Fernschreibzeichen nach CCITT-2 konvertieren. Die Version 51 beliebige Daten.
zh_cn: 模具T310可用于T-310 / 50和T-310 / 51型号。版本50只能解密CCITT-2编码的字符。版本51的任何数据。

# BitSelectorCaption
source: Bit selector
de: Bit-Auswahl
zh_cn: 位选择器

# BitSelectorList1
source: Most significant bits
de: Höchstwertige Bits
zh_cn: 最高有效位

# BitSelectorList2
source: Least significant bits
de: Niedrigstwertige Bits
zh_cn: 最低有效位

# BitSelectorTooltip
source: Choose if the most or least significant bits of certain vectors should be used
de: Bestimmt, ob bei bestimmten Vektoren das höchst- oder niedrigstwertige Bit verwendet werden soll.
zh_cn: 选择是否应使用某些向量的最高或最低有效位

# Key14
source: Long term key 14
de: Langzeitschlüssel 14
zh_cn: 长期钥匙14

# Key15
source: Long term key 15
de: Langzeitschlüssel 15
zh_cn: 长期钥匙15

# Key16
source: Long term key 16
de: Langzeitschlüssel 16
zh_cn: 长期钥匙16

# Key17
source: Long term key 17
de: Langzeitschlüssel 17
zh_cn: 长期钥匙17

# Key21
source: Long term key 21
de: Langzeitschlüssel 21
zh_cn: 长期钥匙21

# Key26
source: Long term key 26
de: Langzeitschlüssel 26
zh_cn: 长期钥匙26

# Key29
source: Long term key 29
de: Langzeitschlüssel 29
zh_cn: 长期钥匙29

# Key30
source: Long term key 30
de: Langzeitschlüssel 30
zh_cn: 长期钥匙30

# Key31
source: Long term key 31
de: Langzeitschlüssel 31
zh_cn: 长期钥匙31

# Key32
source: Long term key 32
de: Langzeitschlüssel 32
zh_cn: 长期钥匙32

# Key33
source: Long term key 33
de: Langzeitschlüssel 33
zh_cn: 长期键33

# LongTermKeyCaption
source: Long term key
de: Langzeitschlüssel
zh_cn: 长期关键

# LongTermKeyTooltip
source: Long term keys were special permutations used in the T-310 block cipher (Wurmreihe D-W). They were fixed to the machine, but could be changed.
de: Langzeitschlüssel waren fest installierte Permutationen, die in der T-310-Blockchiffre (Wurmreihe D-W) verwendet wurden. Bei Bedarf konnten diese getauscht werden.
zh_cn: 长期密钥是T-310分组密码（Wurmreihe DW）中使用的特殊置换。它们固定在机器上，但可以更改。

# InputKeyCaption2
source: Subkey 2
de: Teilschlüssel 2
zh_cn: 子项2

# InputKeyTooltip2
source: Enter a T-310 subkey as binary data. It needs to be exactly 120 bits (15 bytes) long and its parity must be odd.
de: Geben Sie den T-310-Teilschlüssel 2 als Byte-Array ein. Dieser muss eine Länge von 120 Bit (15 Byte) und eine ungerade Parität haben.
zh_cn: 输入T-310子项作为二进制数据。它必须正好为120位（15字节）长，并且其奇偶校验必须为奇数。

# ErrorBothKeysEvenParity
source: Both keys are even. Odd keys are required. Check the documentation for more information.
de: Beide Teilschlüssel sind gerade. Ungerade Schlüssel werden benötigt. Die Dokumentation bietet dazu zusätzliche Informationen.
zh_cn: 两个键都是偶数。需要奇数键。查看文档以获取更多信息。

# ErrorBothKeysLength
source: Both keys have an incorrect length, provide 15 byte (120 bit) keys at both connectors. Both of these keys have to have an odd parity.
de: Beide Teilschlüssel haben eine falsche Länge. Beide müssen eine Länge von 15 Byte (120 Bits) haben. Die Parität beider Schlüssel muss ungerade sein.
zh_cn: 两个密钥的长度都不正确，请在两个连接器上提供15个字节（120位）的密钥。这两个密钥必须具有奇数奇偶校验。

# ErrorBothKeysNull
source: No keys connected, provide 15 byte (120 bit) keys at both connectors. Both these keys have to have an odd parity.
de: Es wurden keine Schlüssel-Konnektoren verbunden. Schließen Sie beide Teilschlüssel zu je 15 Byte Länge (120 Bits) an. Die Parität beider Schlüssel muss ungerade sein.
zh_cn: 未连接任何密钥，请在两个连接器上提供15字节（120位）密钥。这两个密钥必须具有奇数奇偶校验。

# ErrorEmptyConversion
source: After converting the message into CCITT-2 character encoding, no characters of the messages were left. (The message consists completely of invalid characters)
de: Nachdem die Nachricht nach CCITT-2 konvertiert wurde, sind keine Zeichen für die Aktion übrig geblieben. (Die Nachricht besteht nur aus ungültigen Zeichen)
zh_cn: 将消息转换为CCITT-2字符编码后，没有消息的任何字符。 （该消息完全由无效字符组成）

# ErrorHeaderBytes
source: The "magic number bytes" of the message header were invalid (It consists of 4 byte 0x19, 25 bytes inizialization vector and 4 byte 0x0F)
de: Die "Magic-Number-Bytes" des Nachrichten-Headers sind ungültig. (Dieser ist folgend aufgebaut: 4 Byte 0x19, 25 Byte Initialisierungsvektor und 4 Byte 0x0F)
zh_cn: 消息头的“幻数字节”无效（它由4个字节的0x19、25个字节的初始化矢量和4个字节的0x0F组成）

# ErrorHeaderIntegrity
source: The message header is invalid. (It consists of 4 byte 0x19, 25 bytes inizialization vector and 4 byte 0x0F). The 4 byte at the beginning 0x19 and 0x0F at the end were valid.
de: Der Nachrichten-Header ist ungültig. (Dieser ist folgend aufgebaut: 4 Byte 0x19, 25 Byte Initialisierungsvektor und 4 Byte 0x0F). Die vier Byte 0x19 am Anfang und 0x0F am Ende sind korrekt.
zh_cn: 消息头无效。 （它由4个字节的0x19、25个字节的初始化向量和4个字节的0x0F组成）。开头的4个字节0x19和结尾的0x0F有效。

# ErrorHeaderLength
source: Message header could not be parsed, it is too short. Required Length: {0}; Given Length: {1}
de: Der Nachrichten-Header konnte nicht gelesen werden, er ist zu kurz. Benötigte Länge: {0}; Länge der Nachricht: {1}
zh_cn: 无法解析消息头，它太短。所需长度：{0}；给定长度：{1}

# ErrorInputEmpty
source: The input connector is empty, no action can be performed.
de: Die Eingabedaten sind leer, es kann keine Aktion durchgeführt werden.
zh_cn: 输入连接器为空，无法执行任何操作。

# ErrorInputNull
source: No input connected, please connect a byte[] as input.
de: Kein Eingabe-Konnektor verfügbar. Schließen sie ein Byte[] bei Eingabedaten an.
zh_cn: 未连接任何输入，请连接一个byte []作为输入。

# ErrorKeyEvenParity
source: The parity of Key {0} is even. An odd key is required. Check the documentation for more information.
de: Die Parität des Teilschlüssels {0} ist gerade. Ein ungerader Schlüssel wird benötigt. Die Dokumentation bietet dazu zusätzliche Informationen.
zh_cn: 密钥{0}的奇偶校验是偶数。需要一个奇数键。查看文档以获取更多信息。

# ErrorKeyLength
source: Key {0} needs to be exactly 15 bytes long (120 bits). The given Key {0} is {1} bytes long.
de: Der Teilschlüssel {0} muss genau 15 Byte lang sein (120 Bits). Der eingegebene Schlüssel {0} is {1} Bytes lang.
zh_cn: 密钥{0}必须恰好为15个字节长（120位）。给定的密钥{0}的长度为{1}个字节。

# ErrorKeyNull
source: Key {0} is not connected, provide a 15 byte (120 bit) key with an odd parity.
de: An Schlüssel {0} ist kein Eingabe-Konnektor angeschlossen. Schließen sie eine Eingabe mit einem Teilschlüssel der Länge 15 Byte (120 Bits) an. Die Parität dieses Schlüssels muss ungerade sein.
zh_cn: 密钥{0}未连接，请提供一个15字节（120位）的奇偶校验密钥。

# ErrorUnconvertableBeginningPlural
source: There were {0} unconvertable characters in the given message
de: Es waren {0} nicht konvertierbare Zeichen in den Eingabedaten
zh_cn: 给定消息中有{0}个不可转换的字符

# ErrorUnconvertableBeginningSingular
source: There was {0} unconvertable character in the given message
de: Es war {0} nicht konvertierbares Zeichen in den Eingabedaten
zh_cn: 给定消息中有{0}个不可转换的字符

# ErrorUnconvertableEndPlural
source: ; they were truncated before encrypting.
de: ; sie wurden vor dem Verschlüsseln entfernt.
zh_cn: ;它们在加密之前被截断了。

# ErrorUnconvertableEndSingular
source: ; it was truncated before encrypting.
de: ; es wurde vor dem Verschlüsseln entfernt.
zh_cn: ;在加密之前已被截断。
