Repository: JarLob/CrypTool2
Catalog: CrypPlugins/P2PEditor/Properties/Resources.*.resx
Languages: de

source: Account Activation
de: Account-Aktivierung

source: Account Creation
de: Account-Erstellung

source: Account successfully activated
de: Account erfolgreich aktiviert

# ActivateButton_
source: Activate
de: Aktivieren

source: Activating account...
de: Aktiviere Account...

source: Activation Code:
de: Aktivierungscode:

# An_exception_occured___1
source: An exception occured: {0}
de: Es trat ein Fehler auf: {0}

# Autodownloaded_user_account_data_for_user_
source: Autodownloaded user account data for user '{0}'
de: Benutzerkonto '{0}' automatisch heruntergeladen

# Automatic_created_account_folder_
source: Automatic created account folder: {0}
de: Benutzerkontenverzeichnis automatisch erstellt: {0}

# BackButton_
source: Back
de: Zurück

# Cannot_connect_account_not_found_
source: Cannot connect, account '{0}' not found!
de: Verbinden nicht möglich, Benutzerkonto '{0}' konnte nicht gefunden werden.

# Cannot_connect_using_account_
source: Cannot connect using account '{0}': {1}
de: Verbindung mit Benutzerkonto '{0}' nicht möglich: {1}

# Cannot_create_default_account_data_directory_
source: Cannot create default account data directory '{0}': {1}
de: Benutzerkontenverzeichnis kann nicht automatisch erstellt werden '{0}': {1}

source: Certificate authorization required
de: Zertifikatautorisierung erforderlich

source: Confirm:
de: Wiederholen:

# ConnectButton_
source: Connect
de: Verbinden

# Could_not_save_the_received_certificate_to_your_AppData_folder_
source: Could not save the received certificate to your AppData folder:{0}
de: Kann das empfangene Benutzerkonto nicht speichern: {0}

source: Create a new account
de: Neues Benutzerkonto erstellen

source: Distributed Computing Platform
de: Verteilte Berechnungsplattform

source: Email is not valid.
de: Ungültige E-Mail-Adresse

# Error_while_autodownloading_your_account_data_
source: Error while autodownloading your account data: {0}
de: Fehler beim automatischen Herunterladen des Benutzerkontos: {0}

source: Forgot password
de: Passwort vergessen

# GetNewCertificate_RetrieveCertificate_
source: Registration successful. To activate your account, you need to validate your email address. A verification code was sent per email.
de: Um Ihr Benutzerkonto zu aktivieren, öffnen Sie bitte die an Sie gesandte Aktivierungs-E-Mail.

source: HttpTunnel successfully established
de: HttpTunnel erfolgreich aufgebaut

# InvalidCertificateRegistration_Exception_occured___1
source: Exception occured: {0}
de: Fehler aufgetreten: {0}

# InvalidCertificateRegistration_Invalid_registration___1
source: Invalid registration: {0}
de: Ungültige Registrierung: {0}

source: New ProtocolVersion. Please update CrypTool 2.0
de: Neue Protokollversion. Bitte updaten Sie CrypTool 2.0

# No_account_data_found_for_Try_to_download_from_server_
source: No account data found for '{0}'. Try to download from server...
de: Benutzerkonto '{0}' nicht gefunden. Versuche es vom Server zu laden...

source: No proxy server configured. Please check your configuration.
de: Kein Proxyserver konfiguriert. Bitte überprüfen Sie Ihre Einstellungen.

# P2PEditor_Tab_Caption
source: Network
de: Netzwerk

source: Passwords did not match.
de: Passwörter waren nicht gleich.

source: Password:
de: Passwort:

source: Password is not valid.
de: Passwort ist nicht gültig.

# Please_enter_the_activation_code_
source: Please enter the activation code which you received by email. Also enter your password. After clicking the activate button your account data will be stored in your local users folder.
de: Bitte geben Sie den Aktivierungscode ein, den wir Ihnen per E-Mail zugeschickt haben.

# Please_enter_the_data_below_
source: Please enter the data below to request your own personal account (needed for participating in distributed computing - like distributed key searching). CrypTool 2.0 will connect to our server and request your account data. This data will be stored into your application data folder of windows. We will send you an activation code. Use this code to activate your account by clicking the activate button.
de: Bitte füllen Sie die folgenden Felder aus, um Ihr CrypTool 2.0 Benutzerkonto zu erstellen. Das Benutzerkonto ist notwendig, um an der verteilten Berechnungsplattform teilzunehmen.

# ProxyErrorOccured_Proxy_Error___1__occured_
source: Proxy Error ({0}) occured:
de: Proxy Fehler ({0}) trat auf:

# Proxy_Error_occured_
source: Proxy Error '{0}' occured: {1}
de: Proxy Fehler '{0}' trat auf: {1}

source: Remember my password
de: Speichere das Passwort

# RequestButton_
source: Request
de: Anfordern

# Requesting_certificate_
source: Requesting user account...
de: Fordere Account an...

source: SSLCertificate revoked. Please update CrypTool 2.0.
de: SSL-Zertifikat abgelehnt. Bitte updaten Sie CrypTool 2.0.

# There_was_a_communication_problem_with_the_server
source: There was a communication problem with the server: {0} Please try again later
de: Es gab ein Kommunikationproblem mit dem Server: {0}

# The_email_address_was_not_verified_
source: The email address was not verified. Please check your email account for an activation code we just sent to you and activate your account.
de: Ihre E-Mail-Adresse wurde noch nicht verifiziert. Bitte überprüfen Sie Ihre E-Mails auf eine E-Mail mit Verifizierungscode, den wir Ihnen soeben zugeschickt haben.

source: The email already exists. Please choose another one.
de: Diese E-Mail-Adresse existiert bereits. Bitte wählen Sie eine andere.

source: The username already exists. Please choose another one.
de: Dieser Benutzername existiert bereits. Bitte wählen Sie einen anderen.

source: The username and email already exist but the entered password was wrong.
de: Der Benutzername und die E-Mail existieren, aber das eingegebene Passwort war falsch.

source: Username:
de: Benutzername:

source: Username is not valid.
de: Benutzername ist nicht gültig.

# Your_new_account_was_requested_successfully_and_can_be_used_after_verification_
source: Your new account was requested successfully and can be used after verification. Press the OK button to proceed.
de: Ihr Benutzeraccount wurde erfolgreich angefordert und kann nach der E-Mail-Verifizierung genutzt werden.

# Your_new_account_was_successfully_activated_
source: Your new account was successfully activated and can now be used. Press the OK button to proceed.
de: Ihr Benutzeraccount wurde erfolgreich aktiviert und kann jetzt genutzt werden.

source: Your password was wrong. We could not autodownload your account data.
de: Ihr Passwort war falsch. Wir konnten Ihr Benutzerkonto nicht automatisch herunterladen.

source: Password reset
de: Passwort ändern

# Please_enter_your_user_name_
source: Please enter your user name so that we can send a password reset verification code to your registered email address. Use this code to change your accounts password settings.
de: Bitte geben Sie Ihren Benutzernamen ein, damit wir Ihnen einen Änderungsscode an die von Ihnen registrierte E-Mail-Adresse senden können.

source: Resetting password...
de: Passwort zurücksetzen...

# ResetButton_
source: Reset
de: Zurücksetzen

source: The username does not exist
de: Der Benutzername existiert nicht.

# VerifyButton_
source: Verify
de: Verifizieren

# Abort_Button_
source: Abort
de: Abbrechen

source: Author:
de: Autor:

# DeleteButton_
source: Delete
de: Löschen

source: Deleting job {0} ({1}).
de: Lösche Job {0} ({1}).

source: Description:
de: Beschreibung:

# DisconnectButton_
source: Disconnect
de: Trennen

source: Distributed job {0}
de: Job {0} verteilt

source: File not found.
de: Datei nicht gefunden.

# NewButton_
source: New
de: Neu

source: Participants:
de: Teilnehmer:

# ParticipateButton_
source: Participate
de: Teilnehmen

source: Participating...
de: Bitte warten...

source: Please fill all fields.
de: Bitte alle Felder ausfüllen.

source: Preparing to participate in job {0} ({1}).
de: Vorbereitung, um an job teilzunehmen {0} ({1}).

source: Received new job list...
de: Empfange neue Jobliste...

# RefreshButton_
source: Refresh
de: Aktualisieren

source: Requesting new job list...
de: Fordere neue Jobliste an...

source: Running update task.
de: Updateprotokoll ausgeführt.

source: Selected workspace does not exist.
de: Ausgewählte Arbeitsfläche existiert nicht.

# Share_Button_
source: Share
de: Freigeben

source: Start date:
de: Startdatum:

source: Status Key:
de: Status-Schlüssel:

source: Workspace:
de: Arbeitsfläche:

# CreationDate_ColumnHeader_
source: Creation Date
de: Erstelldatum

# Your_request_was_denied_on_serverside_
source: Your request was denied on serverside. Reason: Username or email adresse are revoked.
de: Ihre Anfrage wurde serverseitig abgelehnt. Grund: Benutzername oder E-Mail-Adresse wurden abgelehnt.

# ExperiencedSettingsGroup
source: Experienced Settings
de: Experienced-Einstellungen

# ExpertSettingsGroup
source: Expert Settings
de: Experten-Einstellungen

# ProxySettingsGroup
source: Proxy Settings
de: Proxy-Einstellungen

# ServerSettingsGroup
source: Server Settings
de: Server-Einstellungen

# architecture_caption
source: Architecture
de: Architektur

# architecture_tooltip
source: Architecture
de: Architektur

# connectOnStartup_caption
source: Connect on startup
de: Beim Starten verbinden

# connectOnStartup_tooltip
source: Connect on startup
de: Beim Starten verbinden

# distributedJobListRefreshInterval_caption
source: Distributed joblist refresh interval
de: Verteilte Jobliste Refresh-Intervall

# distributedJobListRefreshInterval_tooltip
source: Distributed joblist refresh interval
de: Verteilte Jobliste Refresh-Intervall

# localPort_caption
source: Local Port
de: Lokaler Port

# localPort_tooltip
source: Local Port
de: Lokaler Port

# networksize_caption
source: Networksize
de: Netzwerkgröße

# networksize_tooltip
source: Networksize
de: Netzwerkgröße

# proxypassword_caption
source: Proxy password
de: Proxy Passwort

# proxypassword_tooltip
source: Proxy password
de: Proxy Passwort

# proxysettingssystem_caption
source: Use system proxy settings
de: Systemproxyeinstellungen nutzen

# proxysettingssystem_tooltip
source: Use system proxy settings
de: Systemproxyeinstellungen nutzen

# proxysettings_caption
source: Use proxy
de: Proxy nutzen

# proxysettings_tooltip
source: Use proxy
de: Proxy nutzen

# proxyuser_caption
source: Proxy user
de: Proxy Benutzer

# proxyuser_tooltip
source: Proxy user
de: Proxy Benutzer

# useLocalAddressDetection_caption
source: Use local addresse detection
de: Benutze lokale Address-Detection

# useLocalAddressDetection_tooltip
source: Use local addresse detection
de: Benutze lokale Address-Detection

# workspacePath_caption
source: Workspace path
de: Arbeitsplatz Pfad

# workspacePath_tooltip
source: Workspace path
de: Arbeitsplatz Pfad

# worldname_caption
source: Worldname
de: Weltname

# worldname_tooltip
source: Worldname
de: Weltname

source: Password reset verification
de: Verifikation Passwort rücksetzen

source: Password successfully resetted
de: Passwort erfolgreich zurückgesetzt

# Please_enter_the_password_reset_verification_code
source: Please enter the password reset verification code which you should have received by email. Also choose a new password and confirm it. By clicking the reset button you will receive your new account data immediately.
de: Bitte geben Sie den Bestätigungscode ein, den Sie per E-Mail erhalten haben, um das Passwort zurück zu setzen. Wählen Sie ein neues Passwort und bestätigen Sie dieses. Sie erhalten Ihren neuen Account sofort, nachdem Sie das Passwort zurückgesetzt haben.

source: Reset password...
de: Passwort zurücksetzen...

source: _Verification Code:
de: Bestätigungscode:

# Your_password_was_successfully_resetted
source: Your password was successfully resetted. Press the OK button to proceed.
de: Ihr Passwort wurde zurückgesetzt. Klicken Sie OK um fortzufahren.

source: Account reset data not found
de: Daten für Account-Reset nicht gefunden

source: Activation code may not be empty.
de: Aktivierungscode darf nicht leer sein.

source: Invalid passwort reset verification: {0}
de: Ungültige Passwort-Reset-Verifikation: {0}

# nvalid_certificate_request___0_
source: Invalid certificate request: {0}
de: Ungültige Zertifikatsanfrage: {0}

source: Our email server is currently offline. Please try again later.
de: Unser E-Mail-Server ist momentan offline. Bitte versuchen Sie es später noch einmal.

source: P2P Configuration
de: P2P-Konfiguration

source: Please check your email account for a password reset verification code.
de: Bitte überprüfen Sie Ihren E-Mail-Eingang nach dem Bestätigunscode für das Rücksetzen des Passwortes.

# PluginTooltip
source: Control interface for the integrated P2P network.
de: Kontroll-Interface für das integrierte P2P-Netzwerk.

# Registration_successful_To_activate_your_account_you_need_
source: Registration successful. To activate your account, you need to validate your email address. A verification code was sent per email.
de: Registrierung erfolgreich. Um Ihren Account zu aktivieren, müssen Sie Ihre E-Mail-Adresse bestätigen. Ein Bestätigungscode wurde Ihnen per E-Mail zugeschickt.

source: The verification code is ok but the entered password was wrong.
de: Der Bestätigungscode ist richtig, aber das Passwort stimmt nicht.

source: Your password change was already verified.
de: Ihre Passwortänderung wurde bereits verifiziert.

source: _Verify
de: _Verifizieren

source: We had an error: {0}
de: Ein Fehler trat auf: {0}

source: Wrong code
de: Falscher Code

source: Your account is not yet authorized.
de: Ihr Account ist noch nicht autorisiert.

source: Your account is revoked.
de: Ihr Account wurde annulliert.

source: Your certificate was not authorized, so a reset is not possible at this moment
de: Ihr Zertifikat wurde nicht autorisiert. Ein Reset ist im Moment nicht möglich.

source: Your certificate was revoked. You can not reset it.
de: Ihr Zertifikat wurde widerrufen. Sie können es nicht zurücksetzen.

source: You have entered a wrong verification code.
de: Sie haben einen falschen Bestätigungscode angegeben.
