Repository: JarLob/CrypTool2
Catalog: CrypPlugins/StegoLeastSignificantBit/Properties/Resources.*.resx
Languages: de_de, ru

# ActionCaption
source: Action
de_de: Aktion
ru: действие

# ActionList1
source: Encrypt
de_de: Verschlüsselung
ru: шифровать

# ActionList2
source: Decrypt
de_de: Entschlüsselung
ru: расшифровывать

# ActionTooltip
source: Select the Algorithm action
de_de: Wählen Sie die Betriebsart des Plugins.
ru: Выберите действие «Алгоритм»

# BitCountCaption
source: Bit count
de_de: Bitanzahl
ru: Количество бит

# BitCountSettingsCaption
source: Bit count
de_de: Bitanzahl
ru: Количество бит

# BitCountSettingsTooltip
source: Count of bits per pixel/sample that are treated as least significant
de_de: Anzahl der Bits, die pro Pixel/Sample in den deren niederwertigen Bits versteckt werden sollen.
ru: Количество бит на пиксель / образец, которые считаются наименее значимыми

# BitCountTooltip
source: Count of bits per pixel/sample that are treated as least significant. This is the same setting as the shift value from the settings pane but as dynamic input.
de_de: Anzahl der Bits, die pro Pixel/Sample in den deren niederwertigen Bits versteckt werden sollen.
ru: Количество бит на пиксель / образец, которые считаются наименее значимыми. Это та же настройка, что и значение сдвига на панели настроек, но как динамический вход.

# CustomizeRegionsCaption
source: Customize regions
de_de: Regionen definieren
ru: Настройка регионов

# CustomizeRegionsTooltip
source: Opens a dialog that lets the user define where in the picture the data will be hidden.
de_de: Öffnet ein Dialogfenster, in dem man die Regionen des Bildes definieren kann, in denen die Daten versteckt werden sollen.
ru: Открывает диалог, который позволяет пользователю определить, где на картинке данные будут скрыты.

# InputCarrierCaption
source: Carrier image input
de_de: Eingabe der Trägerdatei
ru: Вход изображения несущей

# InputCarrierTooltip
source: Input of the carrier image in which to hide data (Encryption) or from which to extract the hidden data (Decryption)
de_de: Eingabe des Trägers (bei Verschlüsselung) bzw. des Trägers mit den versteckten Daten (bei Entschlüsselung)
ru: Ввод изображения носителя, в котором можно скрыть данные (Шифрование) или из которых извлечь скрытые данные (Расшифровка)

# InputDataCaption
source: Message
de_de: Klartext
ru: Сообщение

# InputDataTooltip
source: Input of the data that is to be hidden in the carrier image
de_de: Die in der Trägerdatei zu versteckenden Daten.
ru: Ввод данных, которые должны быть скрыты в изображении носителя

# InputPasswordCaption
source: Password
ru: пароль

# InputPasswordTooltip
source: Password as a stream
ru: Пароль как поток

# OutputCarrierCaption
source: Carrier image output
de_de: Ausgabe der Trägerdatei
ru: Выход изображения несущей

# OutputCarrierTooltip
source: Output of the carrier image with the hidden data.
de_de: Trägerdatei, in der die Eingabedaten versteckt wurden, bzw. die von den versteckten Daten bereinigt wurde.
ru: Вывод изображения носителя со скрытыми данными.

# OutputDataCaption
source: Data output
de_de: Datenausgabe
ru: Выход данных

# OutputDataTooltip
source: Output of the secrect data that was extracted from the carrier image.
de_de: Ausgabe der extrahierten Nutzdaten
ru: Вывод секретных данных, которые были извлечены из изображения носителя.

# OutputFileFormatCaption
source: Output File Format
de_de: Format der Ausgabedatei
ru: Формат выходного файла

# OutputFileFormatTooltip
source: Only for Encryption: The file format of the output image.
de_de: Nur für die Verschlüsselung: Das Dateiformat der auszugebenden Bilddatei.
ru: Только для шифрования: формат файла выходного изображения.

# PluginCaption
source: LSB Steganography
de_de: StegoLeastSignificantBit
ru: Стеганография LSB

# PluginTooltip
source: Hide a message in the least significant bits of a picture.
de_de: Verstecke Daten in den niederwertigen Bits einer Bilddatei.
ru: Скрывает сообщение в наименее значимых битах изображения

# RegionCancel
source: Cancel
ru: Отмена

# RegionDelete
source: Delete
ru: Удалить

# RegionErrorCapacity
source: Overall capacity must be equal to or greater than the message length.
ru: Общая емкость должна быть равна или больше длины сообщения.

# RegionErrorHidden
source: The number of hidden bytes must be equal to or greater than the message length.
ru: Количество скрытых байтов должно быть равно или больше длины сообщения.

# RegionExtractClose
source: Close
ru: Закрыть

# RegionExtractMessage
source: Hidden message:
ru: Скрытое сообщение:

# RegionExtractRegions
source: Regions:
ru: Регионы:

# RegionExtractTitle
source: Content of the carrier image
ru: Содержимое изображения носителя

# RegionHeaderSize
source: Header length:
ru: Длина заголовка:

# RegionHeaderSpace
source: Space for header:
ru: Пробел для заголовка:

# RegionHideTitle
source: Define the Regions of the Image
ru: Определение областей изображения

# RegionLabel2
source: Bitmap and regions - Click to draw a region, double-click to finish it:
ru: Растровое изображение и регионы. Нажмите, чтобы нарисовать регион, дважды щелкните его, чтобы закончить.

# RegionLabel3
source: Only regions, just for your information:
ru: Только регионы, только для вашей информации:

# RegionLabel4
source: Please configure the regions and make sure the sum of the hidden bytes matches the message length:
ru: Пожалуйста, настройте регионы и убедитесь, что сумма скрытых байтов соответствует длине сообщения:

# RegionListLabel1
source: Percent of image
ru: Процент изображения

# RegionListLabel2
source: Pixel
ru: пиксель

# RegionListLabel3
source: Region
ru: Область

# RegionListLabel4
source: Hidden bytes
ru: Скрытые байты

# RegionListLabel5
source: Capacity
ru: Вместимость

# RegionMaxRegion
source: Maximum region
ru: Максимальная область

# RegionMessageSize
source: Message length:
ru: Длина сообщения:

# RegionOneRegion
source: Please define one or more regions.
ru: Укажите один или несколько регионов.

# RegionPixel
source: Pixel
ru: пиксель

# RegionPixels
source: Pixels
ru: Пиксели

# RegionRemoveTopmost
source: Please remove the topmost region.
ru: Удалите верхний регион.

# RegionSummary
source: Summary:
ru: Резюме:

# ShowRegionsCaption
source: Show regions
ru: Показать регионы

# ShowRegionsTooltip
source: Opens a dialog that displays where in the picture the data is hidden.
ru: Открывает диалоговое окно, отображающее, где на картинке скрыты данные.
