Repository: JarLob/CrypTool2
Catalog: CrypPlugins/SZ42/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Lorenz SZ42
zh_cn: 洛伦兹SZ42

# PluginTooltip
source: Represents the SZ42 Lorenz machine
de: Lorenz-Schlüsselmaschine SZ42
ru: Представляет машину SZ42 Lorenz
zh_cn: 代表SZ42 Lorenz机器

# InputStringCaption
source: Text Input
de: Eingabetext
ru: Ввод текста
zh_cn: 文字输入

# InputStringTooltip
source: Input a string to be processed by the SZ42 cipher
de: Geben Sie den Text ein, der mit dem SZ42 ver- oder entschlüsselt werden soll.
ru: Введите строку, подлежащую обработке с помощью шифра SZ42
zh_cn: 输入要由SZ42密码处理的字符串

# OutputStringCaption
source: Text output
de: Ausgabetext
ru: Вывод текста
zh_cn: 文字输出

# OutputStringTooltip
source: The string after processing with the SZ42 cipher
de: Der mit der SZ42 ver-/entschlüsselte Text
ru: Строка после обработки с помощью шифра SZ42
zh_cn: 使用SZ42密码处理后的字符串

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTooltip
source: Select the Algorithm action
de: Wählen Sie die Betriebsart des Plugins.
ru: Выберите действие «Алгоритм»
zh_cn: 选择算法动作

# InputParsedCaption
source: Input Parsed
de: übersetzte Eingabe
ru: Входной анализ
zh_cn: 输入解析

# InputParsedTooltip
source: Set if the input is parsed or not
de: Ist die Eingabe übersetzt?
ru: Установите, если вход разобран или нет.
zh_cn: 设置是否解析输入

# LimitationCaption
source: Limitation
ru: ограничение
zh_cn: 局限性

# LimitationTooltip
source: Select the limitation type
de: Wählen Sie den Limitation-Typ
ru: Выберите тип ограничения
zh_cn: 选择限制类型

# OutputParsedCaption
source: Output Parsed
de: übersetzte Ausgabe
ru: Выходной анализ
zh_cn: 输出解析

# OutputParsedTooltip
source: Set if the output is parsed or not
de: Soll die Ausgabe übersetzt werden?
ru: Установите, если результат разобран или нет.
zh_cn: 设置是否解析输出

# PatternΨ1Caption
source: Wheel Ψ1 Pattern
de: Rotor Ψ1
ru: Колесо Ψ1 Шаблон
zh_cn: 车轮Ψ1花纹

# PatternΨ1Tooltip
source: Set the wheel Ψ1 pattern
de: Stiftstellungen für Rotor Ψ1
ru: Установите колесо Ψ1 pattern
zh_cn: 设置车轮Ψ1模式

# PatternΨ2Caption
source: Wheel Ψ2 Pattern
de: Rotor Ψ2
ru: Колесо Ψ2 Образец
zh_cn: 车轮Ψ2花纹

# PatternΨ2Tooltip
source: Set the wheel Ψ2 pattern
de: Stiftstellungen für Rotor Ψ2
ru: Установите колесо Ψ2 pattern
zh_cn: 设置车轮Ψ2模式

# PatternΨ3Caption
source: Wheel Ψ3 Pattern
de: Rotor Ψ3
ru: Колесо Ψ3 Образец
zh_cn: 车轮Ψ3花纹

# PatternΨ3Tooltip
source: Set the wheel Ψ3 pattern
de: Stiftstellungen für Rotor Ψ3
ru: Установите колесо Ψ3 узор
zh_cn: 设置车轮Ψ3模式

# PatternΨ4Caption
source: Wheel Ψ4 Pattern
de: Rotor Ψ4
ru: Колесо Ψ4 Образец
zh_cn: 车轮Ψ4花纹

# PatternΨ4Tooltip
source: Set the wheel Ψ4 pattern
de: Stiftstellungen für Rotor Ψ4
ru: Установите колесо Ψ4 узор
zh_cn: 设置车轮Ψ4模式

# PatternΨ5Caption
source: Wheel Ψ5 Pattern
de: Rotor Ψ5
ru: Колесо Ψ5 Узор
zh_cn: 车轮Ψ5花纹

# PatternΨ5Tooltip
source: Set the wheel Ψ5 pattern
de: Stiftstellungen für Rotor Ψ5
ru: Установите колесо Ψ5 узор
zh_cn: 设置车轮Ψ5模式

# Patternμ37Caption
source: Wheel μ37 Pattern
de: Rotor μ37
ru: Колесо модели μ37
zh_cn: 车轮μ37型

# Patternμ37Tooltip
source: Set the wheel μ37 pattern
de: Stiftstellungen für Rotor μ37
ru: Установите колесо μ37
zh_cn: 设置车轮μ37模式

# Patternμ61Caption
source: Wheel μ61 Pattern
de: Rotor μ61
ru: Колесо модели μ61
zh_cn: 车轮μ61模式

# Patternμ61Tooltip
source: Set the wheel μ61 pattern
de: Stiftstellungen für Rotor μ61
ru: Установите колесо μ61
zh_cn: 设置车轮μ61模式

# Patternχ1Caption
source: Wheel χ1 Pattern
de: Rotor χ1
ru: Колесо х1
zh_cn: 车轮χ1模式

# Patternχ1Tooltip
source: Set the wheel χ1 pattern
de: Stiftstellungen für Rotor χ1
ru: Установите колесо x1
zh_cn: 设置车轮χ1模式

# Patternχ2Caption
source: Wheel χ2 Pattern
de: Rotor χ2
ru: Колесо х2
zh_cn: 车轮χ2模式

# Patternχ2Tooltip
source: Set the wheel χ2 pattern
de: Stiftstellungen für Rotor χ2
ru: Установите колесо χ2
zh_cn: 设置车轮χ2模式

# Patternχ3Caption
source: Wheel χ3 Pattern
de: Rotor χ3
ru: Колесо х3
zh_cn: 车轮χ3模式

# Patternχ3Tooltip
source: Set the wheel χ3 pattern
de: Stiftstellungen für Rotor χ3
ru: Установите колесо χ3
zh_cn: 设置车轮χ3模式

# Patternχ4Caption
source: Wheel χ4 Pattern
de: Rotor χ4
ru: Колесо х4
zh_cn: 车轮χ4模式

# Patternχ4Tooltip
source: Set the wheel χ4 pattern
de: Stiftstellungen für Rotor χ4
ru: Установите колесо χ4
zh_cn: 设置车轮χ4模式

# Patternχ5Caption
source: Wheel χ5 Pattern
de: Rotor χ5
ru: Колесо х5
zh_cn: 车轮χ5花纹

# Patternχ5Tooltip
source: Set the wheel χ5 pattern
de: Stiftstellungen für Rotor χ5
ru: Установите колесо χ5
zh_cn: 设置车轮χ5模式

# PositionΨ1Caption
source: Wheel Ψ1 Position
de: Position Rotor Ψ1
ru: Колесо Ψ1 Положение
zh_cn: 车轮Ψ1位置

# PositionΨ1Tooltip
source: Set the wheel Ψ1 position
de: Wählen Sie die Position von Rotor Ψ1.
ru: Установите положение колеса Ψ1
zh_cn: 设置车轮Ψ1位置

# PositionΨ2Caption
source: Wheel Ψ2 Position
de: Position Rotor Ψ2
ru: Колесо Ψ2 Положение
zh_cn: 车轮Ψ2位置

# PositionΨ2Tooltip
source: Set the wheel Ψ2 position
de: Wählen Sie die Position von Rotor Ψ2.
ru: Установите положение колеса Ψ2
zh_cn: 设置车轮Ψ2位置

# PositionΨ3Caption
source: Wheel Ψ3 Position
de: Position Rotor Ψ3
ru: Колесо Ψ3 Положение
zh_cn: 车轮Ψ3位置

# PositionΨ3Tooltip
source: Set the wheel Ψ3 position
de: Wählen Sie die Position von Rotor Ψ3.
ru: Установите положение колеса Ψ3
zh_cn: 设置车轮Ψ3位置

# PositionΨ4Caption
source: Wheel Ψ4 Position
de: Position Rotor Ψ4
ru: Колесо Ψ4 позиция
zh_cn: 车轮Ψ4位置

# PositionΨ4Tooltip
source: Set the wheel Ψ4 position
de: Wählen Sie die Position von Rotor Ψ4.
ru: Установите положение колеса Ψ4
zh_cn: 设置车轮Ψ4位置

# PositionΨ5Caption
source: Wheel Ψ5 Position
de: Position Rotor Ψ5
ru: Колесо Ψ5 Положение
zh_cn: 车轮Ψ5位置

# PositionΨ5Tooltip
source: Set the wheel Ψ5 position
de: Wählen Sie die Position von Rotor Ψ5.
ru: Установите положение колеса Ψ5
zh_cn: 设置车轮Ψ5位置

# Positionμ37Caption
source: Wheel μ37 Position
de: Position Rotor μ37
ru: Колесо μ37 Положение
zh_cn: 车轮μ37位置

# Positionμ37Tooltip
source: Set the wheel μ37 position
de: Wählen Sie die Position von Rotor μ37.
ru: Установите положение колеса μ37
zh_cn: 设置滚轮μ37的位置

# Positionμ61Caption
source: Wheel μ61 Position
de: Position Rotor μ61
ru: Положение колеса μ61
zh_cn: 车轮μ61位置

# Positionμ61Tooltip
source: Set the wheel μ61 position
de: Wählen Sie die Position von Rotor μ61.
ru: Установите положение колеса μ61
zh_cn: 设置滚轮μ61位置

# Positionχ1Caption
source: Wheel χ1 Position
de: Position Rotor χ1
ru: Колесо х1 позиция
zh_cn: 车轮χ1位置

# Positionχ1Tooltip
source: Set the wheel χ1 position
de: Wählen Sie die Position von Rotor χ1.
ru: Установите положение колеса χ1
zh_cn: 设置车轮χ1位置

# Positionχ2Caption
source: Wheel χ2 Position
de: Position Rotor χ2
ru: Колесо х2 Позиция
zh_cn: 车轮χ2位置

# Positionχ2Tooltip
source: Set the wheel χ2 position
de: Wählen Sie die Position von Rotor χ2.
ru: Установите положение колеса χ2
zh_cn: 设置车轮χ2位置

# Positionχ3Caption
source: Wheel χ3 Position
de: Position Rotor χ3
ru: Колесо х3 позиция
zh_cn: 车轮χ3位置

# Positionχ3Tooltip
source: Set the wheel χ3 position
de: Wählen Sie die Position von Rotor χ3.
ru: Установите положение колеса χ3
zh_cn: 设置车轮χ3的位置

# Positionχ4Caption
source: Wheel χ4 Position
de: Position Rotor χ4
ru: Положение колеса χ4
zh_cn: 车轮χ4位置

# Positionχ4Tooltip
source: Set the wheel χ4 position
de: Wählen Sie die Position von Rotor χ4.
ru: Установите положение колеса χ4
zh_cn: 设置车轮χ4位置

# Positionχ5Caption
source: Wheel χ5 Position
de: Position Rotor χ5
ru: Колесо х5 позиция
zh_cn: 车轮χ5位置

# Positionχ5Tooltip
source: Set the wheel χ5 position
de: Wählen Sie die Position von Rotor χ5.
ru: Задайте позицию колеса x5
zh_cn: 设置车轮χ5位置

# ActionList1
source: Encrypt
de: Verschlüsselung
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsselung
ru: расшифровывать
zh_cn: 解密

# FormatGroup
source: Format Settings
de: Format-Einstellungen
ru: Настройки формата
zh_cn: 格式设定

# LimitationList1
source: Chi2 One Back
zh_cn: Chi2一回

# LimitationList2
source: None
de: Keine
ru: Никто
zh_cn: 没有

# PatternGroup
source: Wheels Patterns
de: Stiftstellungen
ru: Шаблоны колес
zh_cn: 车轮花纹

# PositionGroup
source: Wheels Positions
de: Rotorpositionen
ru: Колесные позиции
zh_cn: 车轮位置

# GeneralSettingsGroup
source: General Settings
de: Allgemeine Einstellungen
ru: общие настройки
zh_cn: 通用设置
