Repository: JarLob/CrypTool2
Catalog: CrypPlugins/StringOperations/Properties/Resources.*.resx
Languages: de

# BlocksizeCaption
source: Blocksize
de: Blockgröße

# BlocksizeTooltip
source: Size of blocks in which this string should be splitted.
de: Größe der Blöcke in die diese Zeichenkette aufgeteilt werden soll.

# OperationCaption
source: Operation
de: Funktion

# OperationCaptionToolTip
source: Change the operation of this StringOperations
de: Wählen Sie die Funktion, die auf die Zeichenketten angewendet werden soll.

# OperationList1
source: Concatenate
de: Konkatenieren

# OperationList10
source: Replace
de: Ersetzen

# OperationList11
source: RegexReplace
de: RegexErsetzen

# OperationList12
source: Split
de: Trennen

# OperationList14
source: Reverse
de: Umkehren

# OperationList2
source: Substring
de: Teilstring

# OperationList3
source: ToLowercase
de: Kleinbuchstaben

# OperationList4
source: ToUppercase
de: Großbuchstaben

# OperationList5
source: Length
de: Länge

# OperationList6
source: CompareTo
de: Vergleichen

# OperationList7
source: Trim
de: Trimmen

# OperationList8
source: IndexOf
de: IndexVon

# OperationList9
source: Equals
de: Gleichheit

# OutputStringArrayCaption
source: OutputStringArray
de: Ausgabe des Zeichenketten-Arrays

# OutputStringArrayTooltip
source: The output strings created by this operation in an array of strings
de: Ausgabe der resultierenden Zeichenketten als Array

# OutputStringCaption
source: OutputString
de: Ausgabe der Zeichenkette

# OutputStringTooltip
source: The output string created by this operation
de: Ausgabe der resultierenden Zeichenkette

# OutputValueCaption
source: OutputValue
de: Ausgabewert

# OutputValueTooltip
source: The output value of this operation
de: Der Ausgabewert der gewählten Funktion

# PluginCaption
source: String Operations
de: Zeichenketten-Operationen

# PluginTooltip
source: Operations for modifying Strings
de: Funktionen für die Modifikation von Zeichenketten

# String1Caption
source: String-One
de: erste Zeichenkette

# String1Tooltip
source: First input string
de: Eingabe der ersten Zeichenkette

# String2Caption
source: String-Two
de: zweite Zeichenkette

# String2Tooltip
source: Second input string
de: Eingabe der zweiten Zeichenkette

# String3Caption
source: String-Three
de: dritte Zeichenkette

# String3Tooltip
source: Third input string
de: Eingabe der dritten Zeichenkette

# StringOperations_Execute_Could_not_execute_operation___0______1_
source: Could not execute operation '{0}' : {1}
de: Konnte Operation '{0}' nicht ausführen: {1}

# Value1Caption
source: OperationParameter-One
de: erster Funktionsparameter

# Value1Tooltip
source: First operation parameter
de: Eingabe des ersten Funktionsparameters

# Value2Caption
source: OperationParameter-Two
de: zweiter Funktionsparameter

# Value2Tooltip
source: Second operation parameter
de: Eingabe des zweiten Funktionsparameters
