Repository: JarLob/CrypTool2
Catalog: CrypPlugins/LFSR/Properties/Resources.*.resx
Languages: ru

# PluginCaption
source: LFSR
ru: ЛРСОС

# PluginTooltip
source: Linear Feedback Shift Register
ru: Линейный регистр сдвига обратной связи

# InputTapSequenceTooltip
source: TapSequence function in binary presentation.
ru: Строка, содержащая краны как последовательность c_i или как многочлен (например, 1011, который равен строке x ^ 4 + x ^ 2 + x + 1. Заметим, что последний 1, который равен x ^ 0 , неявно устанавливается в 1 внутри плагина).

# InputSeedCaption
source: Seed
ru: семя

# InputSeedTooltip
source: Seed of the LFSR in binary presentation.
ru: Начальное двоичное значение всех состояний (например: 1001).

# InputClockBoolCaption
source: Clock
ru: Часы

# InputClockBoolTooltip
source: Optional clock input. LFSR only advances if clock is true.
ru: Дополнительный внешний тактовый сигнал (через плагин CLK).

# OutputStringCaption
source: String Output
ru: Строковый выход

# OutputStringTooltip
source: Produces the output bits as a string with length==rounds. Use this output without a clock input.
ru: Строка, содержащая выходной поток с длиной раундов (например: 1001001, при условии, что было выполнено семь раундов).

# OutputBoolCaption
source: Boolean Output
ru: Логический вывод

# OutputBoolTooltip
source: LFSR Boolean Output. Use this output together with a clock input.
ru: Содержит текущий выходной бит как логическое значение.

# OutputClockingBitCaption
source: Additional Output Bit
ru: Дополнительный выходной бит

# OutputClockingBitTooltip
source: Additional Output Bit.
ru: Выводит определенный этап LFSR как логическое значение.

# OutputBoolArrayCaption
source: Boolean Array Output of Stages
ru: Вывод этапов в булевом массиве

# OutputBoolArrayTooltip
source: LFSR Boolean Array Output of all Stages.
ru: Вывод всех этапов LFSR.

# AlwaysCreateOutputCaption
source: Always create output
ru: Всегда создавать вывод

# AlwaysCreateOutputTooltip
source: With this checkbox enabled, an output will be generated, even though the clock is set to false. The output bit will be the bit from the last clock cycle.
ru: При включенном флажке будет генерироваться выходной сигнал, даже если для часов установлено значение false. Выходной бит будет бит от последнего такта.

# ClockingBitCaption
source: Additional output bit #
ru: Дополнительный выходной бит #

# ClockingBitTooltip
source: Which bit shall be generated as an additional output? For example as an clocking bit.
ru: Какой бит должен быть сгенерирован как дополнительный выход? Например, как бит синхронизации.

# NoQuickwatchCaption
source: Do not display Quickwatch
ru: Не показывать презентацию

# NoQuickwatchTooltip
source: With this checkbox enabled, no quickwatch will be generated for a better performance.
ru: Если этот флажок включен, презентация не будет показана, и производительность будет лучше.

# OutputStagesCaption
source: Output stages
ru: Этапы выхода

# OutputStagesTooltip
source: With this checkbox enabled, the current state will be output.
ru: При включенном флажке будет выводиться текущее состояние.

# PeriodCaption
source: Period
ru: Период LFSR:

# PeriodTooltip
source: The computed period of the LFSR
ru: Указывает период, зависящий от полинома обратной связи и семян.

# PolynomialCaption
source: Feedback polynomial
ru: Полином обратной связи

# PolynomialTooltip
source: Define the feedback polynomial either in a textual or a numeric way. For example x^5 + x^2 + 1 which is equal to 10010.
ru: Определите полином обратной связи либо текстовым, либо цифровым способом. Например, x ^ 5 + x ^ 2 + 1, равное 10010.

# RoundsCaption
source: Rounds
ru: Туры

# RoundsTooltip
source: How many bits shall be generated? Note: This only applies if no external clock is used.
ru: Сколько бит должно быть сгенерировано? Примечание. Это применимо только в том случае, если не используются внешние часы.

# SaveCurrentStateCaption
source: Save the state of the LFSR
ru: Сохранить состояние LFSR

# SaveCurrentStateTooltip
source: With this checkbox enabled, the current state will be restored after opening a .cte.
ru: Сохраняет текущее состояние при остановке и перезапуске плагина или сохранении рабочего пространства.

# SeedCaption
source: Seed
ru: семя

# SeedTooltip
source: Define the seed (initial state) of the LFSR. For example 11100
ru: Определите семя (начальное состояние) LFSR. Например, 11100.

# UseAdditionalOutputBitCaption
source: Generate add. output bit
ru: Создать add. выходной бит

# UseAdditionalOutputBitTooltip
source: With this checkbox enabled, the additional output bit will be generated.
ru: При включенном флажке будет генерироваться дополнительный выходной бит.

# UseBoolClockCaption
source: Use external clock
ru: Использовать внешние часы

# UseBoolClockTooltip
source: With this checkbox enabled, an external clock will be used.
ru: При включенном флажке будут использоваться внешние часы.

# UseBoolClockTPCaption
source: Use external clock
ru: Использовать внешние часы

# UseBoolClockTPTooltip
source: With this checkbox enabled, an external clock will be used (f.e. the CLK-Plugin).
ru: При включенном флажке будут использоваться внешние часы (например, компонент CLK).

# initLFSRCaption
source: Draw LFSR
ru: Нарисуйте LFSR

# initLFSRTooltip
source: Initializes LFSR and draws the presentation. This is used to view the LFSR before pressing play.
ru: Рисует представление LFSR, если полином подходит к семени.

source: No Quickwatch data right now.
ru: Данных сейчас нет.

# AlwaysCreateOutputList1
source: Always generate output?
ru: Всегда генерировать вывод?

# ClockGroup
source: Clock Properties
ru: Свойства часов

# ClockingBitGroup
source: Additional Output Bit
ru: Дополнительный выходной бит

source: Feedback polynomial
ru: Полином обратной связи

# NoQuickwatchList1
source: Display Quickwatch?
ru: Показать презентацию?

source: Period of LFSR
ru: Период LFSR

# SaveCurrentStateList1
source: Save current state?
ru: Сохранить текущее состояние?

# UseAdditionalOutputBitList1
source: Generate additional output bit?
ru: Создать дополнительный бит вывода?

# UseBoolClockList1
source: Use external clock?
ru: Использовать внешние часы?
