Repository: JarLob/CrypTool2
Catalog: CrypPluginsExperimental/TestVectorGenerator/Properties/Resources.*.resx
Languages: de, ru

# TVGcaption
source: TestVectorGenerator
ru: Тест Векторный генератор

source: Alphabet input is empty!
de: Die Alphabet-Eingabe ist leer!
ru: Вход в алфавит пуст!

source: Too many sentences added for length:
de: Zu viele Sätze hinzugefügt für die Länge:
ru: Слишком много предложений добавлено для длины:

# AlphabetInputCaption
source: Alphabet
ru: Алфавит

# AlphabetInputTooltip
source: The optional alphabet to use for the key generation
de: Die optionale Alphabet-Eingabe für die Key-Generierung
ru: Необязательный алфавит, используемый для генерации ключа

# DebugOutputCaption
source: Debug Output
de: Debug-Ausgabe
ru: Отладочный вывод

# DebugOutputTooltip
source: The debug output can be used to get additional debug information
de: Die Debug-Ausgabe kann für zusätzliche Debug-Informationen genutzt werden
ru: Отладочный вывод может использоваться для получения дополнительной информации об отладке

# KeyOutputCaption
source: Key
de: Schlüssel
ru: ключ

# KeyOutputTooltip
source: The generated key
de: Der generierte Schlüssel
ru: Сгенерированный ключ

# PlaintextOutputCaption
source: Plaintext
de: Klartext
ru: Простой текст

# PlaintextOutputTooltip
source: The generated plaintext
de: Der generierte Klartext
ru: Сгенерированный открытый текст

# RegexInputCaption
source: Regex Pattern
de: Regex-Muster
ru: Регулярное выражение

# RegexInputTooltip
source: The regex pattern for the reverse regex key generation
de: Das Regex-Muster für die Schlüssel-Generierung mittels Revers-Regex
ru: Шаблон регулярного выражения для генерации ключа обратного регулярного выражения

# SeedInputCaption
source: Seed
de: Samen
ru: семя

# SeedInputTooltip
source: The seed for the pseudo-random number generator, making test vectors reproducible
de: Der Samenwert (Seed) der vom Pseudo-Zufallszahlen-Generator genutzt wird, wodurch die Testvektoren reproduzierbar sind
ru: Семя для генератора псевдослучайных чисел, делая тестовые векторы воспроизводимыми

# TextInputCaption
source: Input Text
de: Eingabetext
ru: Входной текст

# TextInputTooltip
source: The input text from which the plaintexts and natural language keys are taken
de: Der Eingabetext vom dem die Klartexte und Natürliche-Sprache-Schlüssel entnommen werden
ru: Текст ввода, из которого берутся открытые тексты и клавиши естественного языка

# TotalKeysCaption
source: Total Keys
de: Gesamte Schlüssel
ru: Всего ключей

# TotalKeysTooltip
source: The total number of keys to generate
de: Die Gesamtzahl der Schlüssel die generiert werden sollen
ru: Общее количество ключей для генерации

# TVGtooltip
source: Generates keys and plaintexts as test vectors
de: Generiert Schlüssel und Klartexte als Testvektoren
ru: Генерирует ключи и открытые тексты в качестве тестовых векторов

# input_text_too_short
source: The input text seems to be too short for the entered amount of plaintexts!
de: Der eingegebene Text scheint zu kurz zu sein für die eingegebene Anzahl an Klartexten!
ru: Текст ввода кажется слишком коротким для введенного количества открытых текстов!

# Alphabet_length_is_too_short
source: Alphabet length ({0}) is too short to generate a string of length {1} of unique letters!
de: Die Alphabet-Länge ({0}) ist zu kurz um eine Zeichenkette der Länge {1} aus einmaligen Buchstaben zu generieren!
ru: Длина алфавита ({0}) слишком короткая, чтобы создать строку длины {1} уникальных букв!

# Alphabet_with_hypen_not_recognized_
source: Alphabet with single '-' not recognized!
de: Das Alphabet mit einfachem '-' wurde nicht erkannt!
ru: Алфавит с единственным «-» не признан!

source: Numeric alphabet not recognized!
de: Numerisches Alphabet nicht erkannt!
ru: Числовой алфавит не распознается!

source: Latin alphabet not recognized!
de: Lateinisches Alphabet nicht erkannt!
ru: Латинский алфавит не распознан!

source: Multiple round brackets not supported yet!
de: Mehrere runde Klammern werden noch nicht unterstützt!
ru: Несколько круглых скобок еще не поддерживаются!

source: Error involving multiple brackets!
de: Fehler bei mehreren Klammern!
ru: Ошибка при использовании нескольких скобок!

source: Error parsing length string!
de: Fehler beim Parsen der Zeichenkette!
ru: Ошибка строки длины синтаксического анализа!

# regexString_does_not_match_regex
source: regexString "{0}" does not match regex "{1}"!
de: Zeichenkette "{0}" stimmt nicht mit regulärem Ausdruck "{1}" überein!
ru: regexString &quot;{0}&quot; не соответствует регулярному выражению &quot;{1}&quot;!

source: The input text is missing!
de: Der Eingabetext fehlt!
ru: Текст ввода отсутствует!

source: The input seed is missing!
de: Der einzugebende Samen fehlt!
ru: Входное семя отсутствует!

source: The input regex is missing!
de: Der einzugebende reguläre Ausdruck fehlt!
ru: Входное регулярное выражение отсутствует!

source: Maximum key length has to be at least minimum key length!
de: Die maximale Schlüssellänge muss mindestens der minimalen Länge entsprechen!
ru: Максимальная длина ключа должна быть как минимум минимальной длины ключа!

source: Maximum text length has to be at least minimum text length!
de: Die maximale Textlänge muss mindestens der minimalen Länge entsprechen!
ru: Максимальная длина текста должна быть как минимум минимальной длины текста!

# The_text_length_increase_has_to_be_
source: The text length increase has to be at most the difference between minimum and maximum text length!
de: Die Erhöhung der Textlänge darf maximal die Differenz zwischen maximaler und minimaler Textlänge betragen!
ru: Увеличение длины текста должно быть не больше разницы между минимальной и максимальной длиной текста!

source: The input text is too small!
de: Der eingegebene Text ist zu kurz!
ru: Входной текст слишком мал!

# All_keys_have_been_generated
source: All keys have been generated. Stopping generation.
de: Alle Testvektoren wurden generiert. Halte die Generierung jetzt an.
ru: Все тестовые векторы были сгенерированы. Прекращение генерации.

# BinaryCaption
source: Binary
de: Binär
ru: двоичный

# DeleteSpacesCaption
source: Delete spaces
de: Lösche Leerzeichen
ru: Удалить пробелы

# DeleteSpacesTooltipCaption
source: Delete the spaces in the input text
de: Lösche die Leerzeichen im Eingabetext
ru: Удаление пробелов во входном тексте

# IgnoreCaption
source: Ignore
de: Ignorieren
ru: игнорировать

# InputAlphabetCaption
source: Use input alphabet
de: Verwende das Eingabe-Alphabet
ru: Использовать вводный алфавит

# keyGenerationTypeCaption
source: Key generation type
de: Typ der Schlüssel-Generierung
ru: Тип генерации ключей

# KeyGenerationTypeTooltipCaption
source: The type of key to generate
de: Der Typ des zu generierenden Schlüssels
ru: Тип ключа для генерации

# KeyGroupCaption
source: Key Settings
de: Schlüssel Einstellungen
ru: Настройки клавиш

# LettersCaption
source: Letters
de: Buchstaben
ru: Буквы

# MaximumKeyLengthCaption
source: Maximum key length
de: Maximale Schlüssellänge
ru: Максимальная длина ключа

# MaximumKeyLengthTooltipCaption
source: Maximum length of the keys to generate
de: Maximale Länge der zu generierenden Schlüssel
ru: Максимальная длина ключей для генерации

# MaximumPlaintextLengthCaption
source: Maximum plaintext length
de: Maximale Klartextlänge
ru: Максимальная длина открытого текста

# MaximumPlaintextLengthCaptionTooltipCaption
source: The longest plaintext length to generate
de: Die größte Klartextlänge die generiert werden soll
ru: Самая длинная длина открытого текста для генерации

# MinimumKeyLengthCaption
source: Minimum key length
de: Minimale Schlüssellänge
ru: Минимальная длина ключа

# MinimumKeyLengthTooltipCaption
source: Minimum length of the keys to generate
de: Minimale Länge der zu generierenden Schlüssel
ru: Минимальная длина ключей для генерации

# MinimumPlaintextLengthCaption
source: Minimum plaintext length
de: Minimale Klartextlänge
ru: Минимальная длина открытого текста

# MinimumPlaintextLengthCaptionTooltipCaption
source: The shortest plaintext length to generate
de: Die kleinste Klartextlänge die generiert werden soll
ru: Самая короткая длина открытого текста для генерации

# NaturalLanguageCaption
source: Natural language
de: Natürliche Sprache
ru: Естественный язык

# NaturalLanguageKeyFormatCaption
source: Natural language key format
de: Natürliche Sprache Schlüsselformat
ru: Формат ключа на естественном языке

# NaturalLanguageKeyFormatTooltipCaption
source: Key format of the natural language key
de: Schlüsselformat der Natürliche-Sprache-Schlüssel
ru: Ключевой формат ключа естественного языка

# NumberHandlingCaption
source: Number handling
de: Zahlen-Behandlung
ru: Обработка номеров

# NumberHandlingTooltipCaption
source: Ignore, remove, or replace numbers in the input text
de: Ignorieren, entfernen oder ersetzen der Zahlen im Eingabetext
ru: Игнорировать, удалять или заменять номера во входном тексте

# NumberOfTestRunsCaption
source: Number of test runs
de: Anzahl der Testläufe
ru: Количество тестовых прогонов

# NumberOfTestRunsTooltipCaption
source: The total number of test runs for this test series
de: Die Gesamtzahl der Testläufe für diese Testserie
ru: Общее количество тестовых прогонов для этой серии тестов

# NumbersCaption
source: Numbers
de: Zahlen
ru: чисел

# NumericKeyFromTextCaption
source: Numeric key derived from text
de: Aus dem Eingabetext abgeleiteter numerischer Schlüssel
ru: Цифровой ключ, полученный из текста

# PeriodReplacerCaption
source: Replace periods with:
de: Ersetze Punkte mit:
ru: Заменить периоды:

# PeriodReplacerTooltipCaption
source: The symbol to replace periods with
de: Das Symbol mit dem Punkte ersetzt werden sollen
ru: Символ для замены периодов

# PeriodSymbolHandlingCaption
source: Period symbol handling
de: Punkte-Behandlung
ru: Обработка символа периода

# PeriodSymbolHandlingTooltipCaption
source: Ignore, remove, or replace the period symbols in the input text
de: Ignorieren, entfernen oder ersetzen der Punkte im Eingabetext
ru: Игнорировать, удалять или заменять символы периода в тексте ввода

# PlaintextGroupCaption
source: Plaintext Settings
de: Klartext-Einstellungen
ru: Настройки Plaintext

# PlaintextLengthStepIncreaseCaption
source: Plaintext length step increase
de: Klartext-Verlängerung pro Schritt
ru: Увеличить

# PlaintextLengthStepIncreaseTooltipCaption
source: The number of alphabet symbols to increase the plaintexts by between generations
de: Die Anzahl von Symbolen um die der Klartext pro Verlängerungs-Schritt verlängert werden soll
ru: Количество символов алфавита для увеличения открытого текста между поколениями

# RandomFromAlphabetCaption
source: Random from alphabet
de: Zufällig vom Alphabet
ru: Случайный от алфавита

# RandomKeyFormatCaption
source: Random key format
de: Zufälliges Schlüssel-Format
ru: Случайный ключевой формат

# RandomKeyFormatTooltipCaption
source: Key format of the random key
de: Schlüssel-Format des zufälligen Schlüssels
ru: Формат ключа случайного ключа

# RandomRegexCaption
source: Random by reverse regex
de: Zufällig durch Revers-Regex
ru: Случайное обратное регулярное выражение

# RemoveCaption
source: Remove
de: Entfernen
ru: Удалить

# ReplaceSzCaption
source: Replace ß by sz
de: Ersetze ß durch sz
ru: Замените ß на sz

# ReplaceSZTooltipCaption
source: Replace ß by sz in the input text
de: Ersetze ß durch sz im Eingabetext
ru: Замените ß на sz в тексте ввода

# ReplaceUmlautsCaption
source: Replace umlauts
de: Ersetze Umlaute
ru: Заменить умлауты

# ReplaceUmlautsTooltipCaption
source: Replace umlauts in the input text
de: Ersetze Umlaute im Eingabetext
ru: Заменить umlauts во входном тексте

# ReplaceWithCaption
source: Replace with:
de: Ersetze mit:
ru: Заменить:

# ReplaceWithEINSCaption
source: Replace with EINS, ZWEI,...
de: Ersetze mit NULL, EINS, ZWEI, ...
ru: Замените ZERO, ONE, TWO, ...

# ReplaceWithNullCaption
source: Replace with NULL, ONE,...
de: Ersetze mit NULL, ONE, TWO, ...
ru: Замените NULL, ONE, TWO, ...

# SentencesFromTextCaption
source: Sentences from text
de: Sätze vom Eingabetext
ru: Предложения из текста

# SeparatorCaption
source: Separator between key symbols
de: Trenner zwischen Schlüssel-Symbolen
ru: Сепаратор между ключевыми символами

# SeparatorTooltipCaption
source: Separator between each of the key symbols to generate
de: Trenn-Symbol zwischen den zu generierenden Schlüssel-Symbolen
ru: Разделитель между каждым из символов ключа для генерации

# ShowExtendedSettingsCaption
source: Show extended settings
de: Zeige erweiterte Einstellungen
ru: Показать расширенные настройки

# ShowExtendedSettingsTooltipCaption
source: Show or hide the extended settings
de: Zeige oder verstecke die erweiterten Einstellungen
ru: Показать или скрыть расширенные настройки

# UniqueSymbolUsageCaption
source: Unique symbol usage
de: Einmalige Symbol-Verwendung
ru: Использование уникального символа

# UniqueSymbolUsageTooltipCaption
source: Use every symbol of the key generation alphabet only once
de: Nutze jedes Symbol des Alphabets für die Schlüssel-Generierung nur einmalig
ru: Используйте каждый символ алфавита генерации ключей только один раз

# UppercaseOnlyCaption
source: Uppercase only
de: Nur Großbuchstaben
ru: Только верхний

# UppercaseOnlyTooltipCaption
source: Transform the input text to uppercase
de: Forme den Eingabetext zu Großbuchstaben um
ru: Преобразование входного текста в верхний регистр.
