Repository: JarLob/CrypTool2
Catalog: CrypPlugins/ADFGVX/Properties/Resources.*.resx
Languages: de_de

# ActionCaption
source: Action
de_de: Aktion

# ActionTooltip
source: Select the Algorithm action
de_de: Wählen Sie die Betriebsart des Plugins

# AlphabetCaseCaption
source: Alphabet case
de_de: Groß-/Kleinschreibung

# AlphabetCaseTooltip
source: Transform the alphabet and input data to upper or lower case
de_de: Transformiere das Alphabet und die Eingabedaten in Groß- bzw. Kleinschreibung

# CleanTranspositionPassCaption
source: Clean transposition password
de_de: bereinigtes Transpositions-Kennwort

# CleanTranspositionPassTooltip
source: Transposition password, with removed non alphabet character und duplicates
de_de: bereinigtes Transpositions-Kennwort, bei dem ungültige und doppelte Zeichen entfernt wurden

# InputAlphabetCaption
source: External alphabet input
de_de: Eingabealphabet

# InputAlphabetTooltip
source: Input a string containing the alphabet which should be used by ADFGVX.\nIf no alphabet is provided on this input, the internal alphabet (a-z,0-9) will be used.
de_de: Geben Sie die Zeichen an, aus denen das Eingabealphabet für ADFGVX bestehen soll. Wenn hier nichts angegeben wird, dann wird das interne Alphabet verwendet (a-z,0-9).

# InputStringCaption
source: Text input
de_de: Eingabetext

# InputStringTooltip
source: Input a string to be processed by the ADFGVX cipher
de_de: Geben Sie einen Text ein, der mit der ADFGVX-Chiffre ver- bzw. entschlüsselt werden soll.

# OutputDataCaption
source: Stream output
de_de: Ausgabedatenstrom

# OutputDataTooltip
source: The string after processing with the ADFGVX cipher is converted to a stream. Default encoding is used.
de_de: Der mit der ADFGVX-Chiffre ver-/entschlüsselte Text, konvertiert in einen Datenstrom

# OutputStringCaption
source: Text output
de_de: Ausgabetext

# OutputStringTooltip
source: The string after processing with the ADFGVX cipher
de_de: Der mit der ADFGVX-Chiffre verschlüsselte Text

# PluginTooltip
source: ADFGVX -- cipher used in WW1, combining substitution and transposition
de_de: ADFGVX -- Chiffre, die im 1. Weltkrieg zum Einsatz kam, Kombination aus Substitution und Transposition

# RandomMatrixCaption
source: Random Matrix
de_de: Zufallsmatrix

# RandomMatrixTooltip
source: Create random matrix
de_de: Erzeuge Zufallsmatrix

# StandardMatrixTooltip
source: Create default matrix
de_de: Erzeuge Standardmatrix

# SubstitutionMatrixCaption
source: Substitution matrix
de_de: Substitutionsmatrix

# SubstitutionMatrixTooltip
source: The matrixed used for encryption/decryption
de_de: Matrix für die Ver-/Entschlüsselung

# SubstitutionPassCaption
source: Substitution password
de_de: Substitutions-Kennwort

# SubstitutionPassTooltip
source: Enter the string of the substitution matrix
de_de: Geben Sie das Kennwort für die Substitution ein

# TranspositionPassCaption
source: Transpositon password
de_de: Transpositons-Kennwort

# TranspositionPassTooltip
source: Transposition password can contain any string of characters. Redundant or invalid characters will be removed before de- or encryption.
de_de: Das Transpositions-Kennwort kann beliebige Zeichen enthalten. Ungültige und mehrfach auftretende Zeichen werden vor der Ver-/Entschlüsselung automatisch entfernt.

# TranspositionPasswordCaption
source: Transposition password
de_de: Transpositons-Kennwort

# TranspositionPasswordTooltip
source: Same setting as Transposition password in Settings-Pane but as dynamic input.
de_de: Das Transpositions-Kennwort kann beliebige Zeichen enthalten. Ungültige und mehrfach auftretende Zeichen werden vor der Ver-/Entschlüsselung automatisch entfernt.

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de_de: Behandlung ungültiger Zeichen

# UnknownSymbolHandlingTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de_de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabealphabets sind?
