Repository: JarLob/CrypTool2
Catalog: CrypPluginsExperimental/CryptAnalysisAnalyzer/Properties/Resources.*.resx
Languages: de, ru

source: PerKeyLen
de: ProSchlüsselLänge
ru: perkeyl

# AverageAxisCaption
source: Average of second Y-axis
de: Durchschnitt der zweiten Y-Achse
ru: Среднее значение второй оси Y

# AverageAxisTooltipCaption
source: Show the average of the second Y-axis
de: Zeige den Durchschnitt der zweiten Y-Achse
ru: Покажите среднее значение второй оси Y

# BestKeyInputCaption
source: Best key
de: Bester Schlüssel
ru: Лучший ключ

# BestKeyInputTooltipCaption
source: The best key found by the used CipherAnalyzer
de: Der beste Schlüssel der von der untersuchten CipherAnalyzer-Komponente gefunden wurde
ru: Самый лучший инструмент, который предлагает используемый CipherAnalyzer

# BestPlaintextInputCaption
source: Best plaintext
de: Bester Klartext
ru: Лучший открытый текст

# BestPlaintextInputTooltipCaption
source: The best plaintext found by the used CipherAnalyzer
de: Der beste Klartext der von der untersuchten CipherAnalyzer-Komponente gefunden wurde
ru: Лучший открытый текст, найденный используемым CipherAnalyzer

# CAAtooltip
source: Analyze cryptanalysis methods
de: Analysiert kryptoanalytische Methoden
ru: Оценивает криптоаналитические методы

# CalculateRuntimeCaption
source: Calculate runtime
de: Berechne Laufzeit
ru: Вычислить время выполнения

# CalculateRuntimeTooltipCaption
source: Calculate the runtime of the algorithm
de: Berechne die Laufzeit des Algorithmus
ru: Вычислить время выполнения алгоритма

# CiphertextInputCaption
source: Ciphertext
de: Geheimtext
ru: зашифрованный

# CiphertextInputTooltipCaption
source: The plaintext encrypted by the used cipher
de: Der durch die verwendete Cipher-Komponente verschlüsselte Klartext
ru: Открытый текст, зашифрованный используемым шифром

# CiphertextLengthCaption
source: Ciphertext length
de: Geheimtextlänge
ru: Длина зашифрованного текста

# DecryptionsCaption
source: Decryptions
de: Entschlüsselungen
ru: расшифровок

# EvaluationInputCaption
source: EvaluationContainer
de: Evaluations-Behälter

# EvaluationInputTooltipCaption
source: The EvaluationContainer with the evaluation data of the current test run from the used CipherAnalyzer
de: Der Evaluations-Behälter mit den Evaluations-Daten des aktuellen Testlaufs der analysierten CipherAnalyzer-Komponente
ru: EvaluationContainer с данными оценки текущего теста от используемого CipherAnalyzer

# EvaluationOutputCaption
source: Evaluation output
de: Evaluations-Ausgabe
ru: Результат оценки

# EvaluationOutputTooltipCaption
source: The evaluation output with all the average values
de: Die Evaluations-Ausgabe mit allen Durchschnittswerten
ru: Вывод оценки со всеми средними значениями

# GnuPlotDataOutputCaption
source: GnuPlot data
de: GnuPlot-Daten
ru: Данные GnuPlot

# GnuPlotDataOutputTooltipCaption
source: GnuPlot data output to be saved in a .dat file and used in a GnuPlot script file
de: Die GnuPlot-Daten-Ausgabe, die in einer .dat-Datei gespeichert werden und mittels eines GnuPlot-Skripts in GnuPlot genutzt werden kann
ru: Вывод данных GnuPlot для сохранения в файле .dat и использования в GnuPlot с помощью файла сценария GnuPlot

# GnuPlotGroupCaption
source: GnuPlot settings
de: GnuPlot-Einstellungen
ru: Настройки GnuPlot

# GnuPlotScriptOutputCaption
source: GnuPlot script
de: GnuPlot-Skript
ru: Скрипт GnuPlot

# GnuPlotScriptOutputTooltipCaption
source: GnuPlot script output to be saved in a .p file and loaded from the GnuPlot command line
de: Die GnuPlot-Skript-Ausgabe, die in einer .p-Datei gespeichert werden und in GnuPlot mittels der GnuPlot-Kommandozeile geladen werden können
ru: Вывод сценария GnuPlot для сохранения в файле .p и загрузки из командной строки GnuPlot

# KeyInputCaption
source: Key
de: Schlüssel
ru: ключ

# KeyInputTooltipCaption
source: The key generated by the TestVectorGenerator
de: Der vom TestVectorGenerator generierte Schlüssel
ru: Ключ, созданный TestVectorGenerator

# KeyLengthCaption
source: Key length
de: Schlüssellänge
ru: Длина ключа

# KeyOutputCaption
source: Key
de: Schlüssel
ru: ключ

# KeyOutputTooltipCaption
source: The key test vector of the current test run (usually provided to both the Cipher and the CipherAnalyzer components)
de: Der Schlüssel des Testvektors des aktuellen Testlaufs (normalerweise wird dieser der Cipher- und der CipherAnalyzer-Komponente bereitgestellt)
ru: Ключевой тестовый вектор текущего тестового прогона (обычно предоставляемый как компонентам Cipher, так и CipherAnalyzer)

# MinimumPercentageCaption
source: Minimal correct percentage
de: Minimaler-Korrekter-Prozentsatz
ru: Минимальный правильный процент

# MinimumPercentageTooltipCaption
source: The minimal percentage the decrypted ciphertext has to match the correct plaintext to count as a successfull decryption
de: Der minimale Prozentsatz von korrekt entschlüsselten Geheimtext-Zeichen um als erfolgreich gewertet zu werden
ru: Минимальный процент расшифрованного зашифрованного текста должен соответствовать правильному открытому тексту, чтобы считать успешное дешифрование

# NoneCaption
source: None
de: Kein
ru: Никто

# NormalizingFactorCaption
source: Normalize axis ranges factor
de: Normalisiere-Achsenberech-Faktor
ru: Нормализовать коэффициент осевых коэффициентов

# NormalizingFactorTooltipCaption
source: The factor by which outstandingly high values have to be higher than the preceding value to be ignored in the standard focus range of the GnuPlot
de: Der Faktor zu dem besonders hohe (oder niedrige) Werte von den benachbarten Werten abweichen müssen um in dem standard Fokus-Bereich des GnuPlots ignoriert zu werden
ru: Коэффициент, по которому выдающиеся высокие (или низкие) значения должны отличаться от смежных значений, которые должны игнорироваться в стандартном диапазоне фокусировки GnuPlot

# PercentDecryptedCaption
source: Percent decrypted
de: Prozentwert der Entschlüsselung
ru: Процент дешифрован

source: Percent decrypted
de: Prozentwert der Entschlüsselung
ru: Процент дешифрован

# PlaintextInputCaption
source: Plaintext
de: Klartext
ru: Простой текст

# PlaintextInputTooltipCaption
source: The plaintext generated by the TestVectorGenerator
de: Der vom TestVectorGenerator generierte Klartext
ru: Открытый текст, созданный TestVectorGenerator

# PlaintextOutputCaption
source: Plaintext
de: Klartext
ru: Простой текст

# PlaintextOutputTooltipCaption
source: The plaintext test vector of the current test run (usually provided to both the Cipher and the CipherAnalyzer components)
de: Der Klartext des Testvektors des aktuellen Testlaufs (normalerweise wird dieser der Cipher- und der CipherAnalyzer-Komponente bereitgestellt)
ru: Вектор теста открытого текста текущего тестового прогона (обычно предоставляется как компонентам Cipher, так и CipherAnalyzer)

# PopulationCaption
source: Population sizes
de: Populationsgrößen
ru: Численность населения

# RestartsCaption
source: Restarts
de: Neustarts
ru: Перезапуск

# RuntimeCaption
source: Runtime
de: Laufzeit
ru: время выполнения

# SecondYAxisCaption
source: Second Y-axis
de: Zweite Y-Achse
ru: Вторая ось Y

# SecondYAxisTooltipCaption
source: Values to show on the second Y-axis
de: Werte auf die auf der zweiten Y-Achse angezeigt werden sollen
ru: Значения, отображаемые на второй оси Y

# SeedInputCaption
source: Seed
de: Samen
ru: семя

# SeedInputTooltipCaption
source: The seed for the pseudo-random number generator, making test vectors reproducible
de: Der Samenwert (Seed) mit dem der Pseudo-Zufallszahlengenerator initialisiert wird, wodurch die Testvektoren reproduzierbar werden
ru: Семя для генератора псевдослучайных чисел, делая тестовые векторы воспроизводимыми

# SuccessCaption
source: Success
de: Erfolg
ru: успех

# SuccessPercentCaption
source: Success and % decrypted
de: Erfolg und % der Entschlüsselung
ru: Успех и% расшифровки

# TabuCaption
source: Tabu set sizes
de: Tabu-Set-Größen
ru: Размеры табу

# TextInputCaption
source: Input text
de: Eingabetext
ru: Текст ввода

# TextInputTooltipCaption
source: The input text from which the plaintexts and natural language keys are taken from
de: Der Eingabetext von dem die Klartexte und Natürliche-Sprache-Schlüssel entnommen werden
ru: Текст ввода, из которого выводятся текстовые и естественные ключи из

# TotalKeysInputCaption
source: Total number of keys
de: Gesamtzahl an Schlüsseln
ru: Общее количество ключей

# TotalKeysInputTooltipCaption
source: The number of keys specified in the TestVectorGenerator
de: Die gesamte Anzahl an Schlüsseln (Testvektoren), die im TestVectorGenerator festgelegt wurde
ru: Количество ключей, указанных в TestVectorGenerator

# TriggerNextKeyCaption
source: Trigger next key
de: Löse nächsten Schlüssel aus
ru: Запустить следующую клавишу

# TriggerNextKeyTooltipCaption
source: The seed for the next test vector generation in the current test series (usually set to the current key)
de: Der Samen für die nächste Testvektor-Generierung der aktuellen Testserie (normalerweise auf den aktuellen Schlüssel gesetzt)
ru: Семя для следующего поколения тестового вектора в текущей серии тестов (обычно устанавливается на текущий ключ)

# XAxisCaption
source: X-axis
de: X-Achse
ru: Ось абсцисс

# XAxisTooltipCaption
source: Values to show on the X-axis
de: Werte die auf der X-Achse angezeigt werden sollen
ru: Значения для отображения по оси X

# YAxisCaption
source: Y-axis
de: Y-Achse
ru: Ось ординат

# YAxisTooltipCaption
source: Values to show on the Y-axis
de: Werte die auf der Y-Achse angezeigt werden sollen
ru: Значения для отображения по оси Y

source: Runtime
de: Laufzeit
ru: время выполнения

source: Time_
de: Zeit_
ru: Время_

source: Succ_PercDecr_
de: Erfolg_ProzEntschl_

source: Succ_
de: Erfolg_

source: PercDecr_
de: ProzEntschl_

source: Decryptions
de: Entschlüsselungen
ru: расшифровок

source: NoDecr_
de: Entschl_

source: Restarts
de: Neustarts
ru: Перезапуск

source: Tabu set sizes
de: Tabu-Set-Größen
ru: Размеры табу

source: Population sizes
de: Populations-Größen
ru: Численность населения

source: Rest_
de: Neust_
ru: Отдых_

source: PerCiphLen
de: ProGeheimLänge

source: Ciphertext length
de: Geheimtextlänge
ru: Длина зашифрованного текста

source: Key length
de: Schlüssellänge
ru: Длина ключа

source: PerTime
de: ProZeit

source: Test series seed:
de: Testserien-Samen:
ru: Семена пробной серии:

source: Average runtime:
de: Durchschnitts-Laufzeit:
ru: Среднее время выполнения:

source: Ciphertext lengths:
de: Geheimtextlängen:
ru: Длины зашифрованного текста:

source: Key lengths:
de: Schlüssellängen:
ru: Длина ключа:

source: Average decryptions necessary:
de: Durchschnittlich benötigte Entschlüsselungen:
ru: Требуется среднее дешифрование:

source: Average restarts:
de: Durchschnittliche Neustarts:
ru: Средние перезагрузки:

source: Average population size:
de: Durchschnittliche Populations-Größe:
ru: Средний размер популяции:

source: Average tabu set size:
de: Durchschnittliche Tabu-Set-Größe:
ru: Средний размер табу:

source: Averagely decrypted:
de: Durchschnittlich entschlüsselt:
ru: Averagely расшифровано:

# Averagely_decrypted_of_min
source: Averagely decrypted: {0}% of min {1}
de: Durchschnittlich entschlüsselt: {0}% von min. {1}
ru: Averagely decrypted: {0}% мин. {1}

source: Average success:
de: Durchschnittlicher Erfolg:
ru: Средний успех:

source: Gnuplot script for plotting data from output GnuPlotData
de: Gnuplot-Skript um die Daten von der GnuPlot-Daten-Ausgabe zu zeichnen
ru: Скрипт Gnuplot для вывода данных из вывода GnuPlotData

source: Save the GnuPlotScript output into a file named
de: Speichere die GnuPlot-Skript-Ausgabe in eine Datei mit dem Namen
ru: Сохраните вывод GnuPlotScript в файл с именем

source: Use 'load {0}.p' to plot
de: Verwende 'load {0}.p' um zu zeichnen
ru: Используйте &#39;load {0} .p&#39; для построения

source: Data for:
de: Daten für:
ru: Данные для:

source: TryGetValue from {0} failed! ciphertextLength: {1}, {2}:
de: TryGetValue() von {0} fehlgeschlagen! Geheimtextlänge: {1}, {2}:
ru: TryGetValue () из {0} не удалось! ciphertextLength: {1}, {2}:

source: Save the GnuPlotData output in a file named
de: Speichere die GnuPlot-Daten-Ausgabe in eine Datei mit dem Namen
ru: Сохраните вывод GnuPlotData в файле с именем

source: General settings
de: Allgemeine-Einstellungen
ru: Общие настройки

source: Style settings
de: Stil-Einstellungen
ru: Настройки стиля

source: Plot settings
de: Diagramm-Einstellungen
ru: Настройки графика

source: x-Axis settings
de: X-Achsen-Einstellungen
ru: Настройки X-Axis

source: y-Axis settings
de: Y-Achsen-Einstellungen
ru: Настройки оси Y

source: second y-Axis settings
de: Zweite-Y-Achse-Einstellungen
ru: Настройки второго Y-Axis

source: plotting
de: Darstellung
ru: Заговор

source: The key input is empty!
de: Die Schlüssel-Eingabe ist leer!
ru: Ввод ключа пуст!

source: The plaintext input is empty!
de: Die Klartext-Eingabe ist leer!
ru: Ввод открытого текста пуст!

source: The seed input is empty! It is required for logging purposes.
de: Die Samen-Eingabe ist leer! Der Samen ist nötig für die Protokollierung.
ru: Вход семени пуст! Он необходим для ведения журнала.

source: Current key number:
de: Aktuelle Schlüsselnummer:
ru: Текущий номер ключа:

source: key number:
de: Schlüsselnummer:
ru: номер ключа:

source: Done
de: Fertig
ru: Готово

source: Last runtime
de: Letzte Laufzeit
ru: Последнее время выполнения

source: Last number of restarts
de: Letzte Anzahl an Neustarts
ru: Последнее количество перезапуска

source: Last number of decryptions
de: Letzte Anzahl an Entschlüsselungen
ru: Последний номер дешифрования

source: Started evaluating
de: Evaluierung gestartet
ru: Начал оценку

# CAAcaption
source: CryptAnalysisAnalyzer
ru: CryptAnalysisEvaluator

# MinimalCorrectPercentageCaption
source: Minimal correct percentage
ru: Минимальный правильный процент

# MinimalCorrectPercentageTooltipCaption
source: The minimal percentage of correctly decrypted ciphertext characters to be judged as success
ru: Минимальный процент правильно дешифрованных символов зашифрованного текста, которые будут оцениваться как успех

source: Tabu_
ru: Табу_

source: ID
ru: Я БЫ
