Repository: JarLob/CrypTool2
Catalog: CrypPlugins/CubeAttack/Properties/Resources.*.resx
Languages: ru

# OutputSuperpolyCaption
source: Output of superpolys
ru: Вывод суперполисов

# OutputSuperpolyTooltip
source: Output of located linearly independent superpolys, cube indexes and its corresponding output bits.
ru: Выход расположенных линейно независимых суперполисов, индексов куба и соответствующих ему выходных битов

# OutputKeyBitsCaption
source: Key bits
ru: Ключевые бит

# OutputKeyBitsTooltip
source: This output provides the result of the secret key bits
ru: Этот результат обеспечивает результат бит секретного ключа.

# CubeattackBlackboxCaption
source: Master for CubeAttack
ru: Мастер для CubeAttack

# CubeattackBlackboxTooltip
source: Master for CubeAttack
ru: Мастер для CubeAttack

# ActionCaption
source: Action
ru: действие

# ActionTooltip
source: Select the cube attack modi
ru: Выберите модификацию кубической атаки

# ConstTestCaption
source: Constant Test
ru: Постоянные тесты

# ConstTestTooltip
source: Number of tests to check if the superpoly is a constant value or not.
ru: Количество тестов для проверки того, является ли суперполя постоянным значением или нет

# EnableLogMessagesCaption
source: Enable Log Messages
ru: Включение сообщений журнала

# EnableLogMessagesTooltip
source: With this checkbox enabled, a lot of log messages will be shown during preprocessing.
ru: Когда этот флажок включен, во время предварительной обработки будет показано много сообщений журнала.

# LinTestCaption
source: Linearity Test
ru: Тесты линейности

# LinTestTooltip
source: Number of linearity tests to check if the superpoly is linear or not.
ru: Количество тестов линейности для проверки линейности суперполи

# MaxCubeCaption
source: Max Cube Size
ru: Максимальный размер куба

# MaxCubeTooltip
source: Maxmium size of the summation cube.
ru: Максимальный размер суммирующего куба

# OpenFilenameCaption
source: Filename
ru: Имя файла

# OpenFilenameTooltip
source: Select the file you want to open. File structure: superpoly cube-indexes output-bit Example: 1+x0+x5 2,6 1
ru: Выберите файл, который хотите открыть. Структура файла: superpoly cube-indexes output-bit Пример: 1 + x0 + x5 2,6 1

# OutputBitCaption
source: Output Bit
ru: Выходной бит

# OutputBitTooltip
source: Chooses the output bit of the black box, which should be evaluated.
ru: Выбирает выходной бит черного ящика, который должен быть оценен

# PublicVarCaption
source: Public Bit Size
ru: Размер публичного бита

# PublicVarTooltip
source: Public input bits (IV or plaintext) of the attacked cryptosystem.
ru: Открытые входные биты (IV или открытый текст) атакованной криптосистемы

# ReadSuperpolysFromFileCaption
source: Read Superpolys From File
ru: Чтение суперполей из файла

# ReadSuperpolysFromFileTooltip
source: With this checkbox enabled, superpolys will be loaded from the selected File and can be evaluated in the online phase.
ru: При включенном флажке суперполисты будут загружены из выбранного файла и могут быть оценены в онлайн-фазе.

# SecretVarCaption
source: Secret Bit Size
ru: Размер секретного бита

# SecretVarTooltip
source: Key size or key length of the attacked cryptosystem.
ru: Длина ключа атакованной криптосистемы

# SetPublicBitsCaption
source: Manual Public Bit Input
ru: Ручной ввод открытых бит

# SetPublicBitsTooltip
source: Possible inputs '0' (set bit to value 0), '1' (set bit to value 1) and '*' (sum the 0/1 value of the bit).
ru: Возможные входы «0» (установить бит в значение 0), «1» (установить бит в значение 1) и «*» (суммировать значение 0/1 бит)

# ActionList1
source: Preprocessing
ru: предварительная обработка

# ActionList2
source: Online
ru: В сети

# ActionList3
source: Manual Public Bit Input
ru: Ручной ввод открытых бит

# EnableLogMessagesList1
source: Enable log messages?
ru: Включить сообщения журнала?

# ReadSuperpolysFromFileList1
source: Read Superpolys From File
ru: Чтение суперполей из файла
