Repository: JarLob/CrypTool2
Catalog: CrypPluginsExperimental/SATAttack/Properties/Resources.*.resx
Languages: ru, zh_cn

# AttackModeCaption
source: Attack type
ru: Тип атаки
zh_cn: 攻击类型

# AttackModeTooltip
source: Specify the type of attack.
ru: Укажите тип атаки.
zh_cn: 指定攻击类型。

# BinaryString
source: (Binary): 0b
ru: (Двоичный): 0b
zh_cn: （二进制）：0b

# BinaryStringError
source: When using the prefix "0b", ensure the string only contains bit values (0 and 1).
ru: При использовании префикса «0b» убедитесь, что строка содержит только битовые значения (0 и 1).
zh_cn: 使用前缀“ 0b”时，请确保字符串仅包含位值（0和1）。

# BitNumberParseError
source: Failed to parse the bit number for {0} variable {1}: {2}.
ru: Не удалось проанализировать номер бита для переменной {0} {1}: {2}.
zh_cn: 无法解析{0}变量{1}：{2}的位数。

# CallingCbmcProcessString
source: Calling CBMC process...
ru: Вызов процесса CBMC ...
zh_cn: 呼叫CBMC程序...

# CallingSatSolverString
source: Calling SAT solver process...
ru: Вызов процесса решения SAT ...
zh_cn: 调用SAT解算器过程...

# CallingSatSolverWithParametersString
source: Calling SAT solver at {0} with parameters {1}.
ru: Вызов SAT-решателя в {0} с параметрами {1}.
zh_cn: 使用参数{1}在{0}处调用SAT求解器。

# CbmcOutputStreamCaption
source: CBMC output stream
ru: Выходной поток CBMC
zh_cn: CBMC输出流

# CbmcOutputStreamTooltip
source: Redirect the output of the CBMC process.
ru: Перенаправить вывод процесса CBMC.
zh_cn: 重定向CBMC进程的输出。

# CbmcProcessError
source: CBMC process returned with an error.
ru: Процесс CBMC возвращен с ошибкой.
zh_cn: CBMC进程返回了错误。

# CbmcProcessKillException
source: Killing CBMC process threw an exception: {0} {1}.
ru: Убивание CBMC-процесса вызвало исключение: {0} {1}.
zh_cn: 终止CBMC进程引发异常：{0} {1}。

# CbmcProcessKillSuccess
source: Successfully killed CBMC process.
ru: Успешно убил процесс CBMC.
zh_cn: 成功终止了CBMC进程。

# CbmcProcessReturnedSuccessfully
source: CBMC process returned successfully after {0} seconds.
ru: Процесс CBMC успешно вернулся после {0} секунд.
zh_cn: {0}秒后，CBMC进程成功返回。

# CbmcProcessReturnedWithExitcode
source: CBMC process returned with exitcode {0}.
ru: Процесс CBMC возвращен с кодом exitcode {0}.
zh_cn: CBMC进程以退出代码{0}返回。

# CiphertextCaption
source: Ciphertext
ru: зашифрованный
zh_cn: 密文

# CiphertextEncodingError
source: Encoding of the ciphertext bits returned with an error.
ru: Кодирование битов зашифрованного текста, возвращаемых с ошибкой.
zh_cn: 错误返回的密文位的编码。

# CiphertextTooltip
source: Enter the ciphertext.
ru: Введите зашифрованный текст.
zh_cn: 输入密文。

# ClearFileNameCaption
source: Clear file name
ru: Очистить имя файла
zh_cn: 清除档案名称

# ClearFileNameTooltip
source: Forget the output file name
ru: Забудьте имя выходного файла
zh_cn: 忘记输出文件名

# CnfFileCaption
source: Save CNF in file
ru: Сохранить CNF в файле
zh_cn: 将CNF保存在文件中

# CnfFileNotFoundError
source: CNF file not found at {0}.
ru: Файл CNF не найден в {0}.
zh_cn: 在{0}找不到CNF文件。

# CnfFileTooltip
source: Choose filename for saving the resulting CNF.
ru: Выберите имя файла для сохранения CNF.
zh_cn: 选择文件名以保存生成的CNF。

# CodefileNotFoundString
source: C-Code file not found at {0}.
ru: Файл C-кода не найден в {0}.
zh_cn: 在{0}处找不到C代码文件。

# CopyingCnfString
source: Copying CNF to {0}…
ru: Копирование CNF на {0} ...
zh_cn: 正在将CNF复制到{0}…

# EncodingInputBitsString
source: Encoding input bits in CNF…
ru: Кодирование входных битов в CNF ...
zh_cn: 在CNF中编码输入位…

# EncodingOutputBitsString
source: Encoding output bits in CNF…
ru: Кодирование выходных битов в CNF ...
zh_cn: 在CNF中编码输出位…

# FailedString
source: failed
ru: не смогли
zh_cn: 失败了

# FileBigWarning
source: File {0} is very big: {1} bytes.
ru: Файл {0} очень большой: {1} байт.
zh_cn: 文件{0}非常大：{1}个字节。

# FileInputCaption
source: File
ru: файл
zh_cn: 文件

# FileInputTooltip
source: Select the input file.
ru: Выберите входной файл.
zh_cn: 选择输入文件。

# FixBitsCaption
source: Fix input bits
ru: Исправить входные биты
zh_cn: 固定输入位

source: Fix bits options
ru: Исправлены биты
zh_cn: 固定位选项

# FixBitsTooltip
source: Check for the option to fix some bits.
ru: Проверьте, есть ли возможность исправить некоторые биты.
zh_cn: 检查修复某些位的选项。

# FixedBitsCaption
source: Fixed bits
ru: Фиксированные бит
zh_cn: 固定位

# FixedBitsEncoding
source: Encoding fixed bits in CNF...
ru: Кодирование фиксированных битов в CNF ...
zh_cn: 在CNF中编码固定位...

# FixedBitsEncodingError
source: Encoding of the fixed bits returned with an error.
ru: Кодирование фиксированных битов, возвращаемых с ошибкой.
zh_cn: 固定位的编码返回错误。

# FixedBitsEncodingHint
source: Only use the characters '0', '1' and '*' to fix bits, the character {0} is not allowed.
ru: Используйте только символы &#39;0&#39;, &#39;1&#39; и &#39;*&#39; для исправления бит, символ {0} не разрешен.
zh_cn: 仅使用字符“ 0”，“ 1”和“ *”来固定位，不允许使用字符{0}。

# FixedBitsEncodingStrangeError
source: Something went wrong in the function encodeFixedBitsInCnf (this code should never be reached).
ru: Что-то пошло не так в функции encodeFixedBitsInCnf (этот код никогда не должен быть достигнут).
zh_cn: 函数encodeFixedBitsInCnf中出了点问题（永远不要到达此代码）。

# FixedBitsError
source: Error retrieving fixed Bits.
ru: Ошибка получения фиксированных битов.
zh_cn: 检索固定位时出错。

# FixedBitsSizeError
source: The amount of fixed bits should be less or equal to the amount of input bits{0}Fixed bits: {1} bits{0}Input bits: {2} bits{0}The fixed bits are truncated to the size of the input bits from least significant bit to most significant bit.
ru: Количество фиксированных битов должно быть меньше или равно количеству входных битов {0} Фиксированные биты: {1} бит {0} Входные биты: {2} биты {0} Фиксированные биты усекаются до размера ввода бит от младшего значащего разряда до самого значимого бита.
zh_cn: 固定位数应小于或等于输入位数{0}固定位数：{1}位数{0}输入位数：{2}位数{0}固定位数将被截断为输入的大小位从最低有效位到最高有效位。

# FixedBitsTooltip
source: Fix an arbitrary number of input bits.
ru: Зафиксируйте произвольное количество входных битов.
zh_cn: 固定任意数量的输入位。

# FixedBitsWarning
source: The fix bits option was selected but no bits were fixed.
ru: Была выбрана опция фиксированных битов, но биты не были исправлены.
zh_cn: 选择了固定位选项，但没有固定位。

# HashEncodingError
source: Hash encoding returned with an error.
ru: Хэш-кодировка вернулась с ошибкой.
zh_cn: 哈希编码返回错误。

# HexadecimalString
source: (Hexadecimal): 0x
ru: (Шестнадцатеричный): 0x
zh_cn: （十六进制）：0x

# HexStringError
source: When using the prefix "0x", ensure the string is an even amount of regular hexadecimal characters.
ru: При использовании префикса «0x» убедитесь, что строка представляет собой ровное количество правильных шестнадцатеричных символов.
zh_cn: 使用前缀“ 0x”时，请确保该字符串是偶数个常规十六进制字符。

# InputFoundString
source: Input found!
ru: Вход найден!
zh_cn: 找到输入！

# InputHashValueCaption
source: Hash value
ru: Значение хеша
zh_cn: 哈希值

# InputHashValueTooltip
source: Enter hash value for a preimage or second preimage attack (prefix "0x" for hexadecimal, "0b" for binary).
ru: Введите хеш-значение для прообраза или второй атаки preimage (префикс «0x» для шестнадцатеричного, «0b» для двоичного).
zh_cn: 输入原始映像或第二次原始映像攻击的哈希值（十六进制为前缀“ 0x”，二进制为“ 0b”）。

# InputMappingError
source: Error retrieving input mapping.
ru: Ошибка получения входного сопоставления.
zh_cn: 检索输入映射时出错。

# InputMessageCaption
source: First preimage
ru: Первый прообраз
zh_cn: 第一张原像

# InputMessageTooltip
source: Provide a first preimage for a second preimage attack (prefix "0x" for hexadecimal, "0b" for binary).
ru: Предоставьте первый прообраз для второй атаки preimage (префикс «0x» для шестнадцатеричного, «0b» для двоичного).
zh_cn: 为第二次原图像攻击提供一个第一原图像（十六进制的前缀“ 0x”，二进制的前缀“ 0b”）。

# InputSelectionCaption
source: Input selection
ru: Выбор входа
zh_cn: 输入选择

# InputSelectionFileInput
source: File input
ru: Вход в файл
zh_cn: 档案输入

# InputSelectionTextInput
source: Text input
ru: Ввод текста
zh_cn: 文字输入

# InputSelectionTooltip
source: Select how the ANSI-C code is passed to the SAT Attack component.
ru: Выберите способ передачи кода ANSI-C компоненту SAT Attack.
zh_cn: 选择如何将ANSI-C代码传递到SAT Attack组件。

# InputStreamCaption
source: Input stream
ru: Входной поток
zh_cn: 输入流

# InputStreamTooltip
source: Connect the input stream to a text input component which contains the ANSI-C code of a cryptographic function.
ru: Подключите входной поток к компоненту ввода текста, который содержит код ANSI-C криптографической функции.
zh_cn: 将输入流连接到包含密码功能的ANSI-C代码的文本输入组件。

# InputVariablesSizeFailureString
source: Failed to get the size of input variables.
ru: Не удалось получить размер входных переменных.
zh_cn: 无法获取输入变量的大小。

source: Key-recovery attack
ru: Ключ-восстановление
zh_cn: 密钥恢复攻击

source: Key-recovery attack options
ru: Варианты атаки для восстановления ключей
zh_cn: 密钥恢复攻击选项

# LiteralParseError
source: Failed to parse the literal for {0} variable {1}:{2}.
ru: Не удалось проанализировать литерал для переменной {0} {1}: {2}.
zh_cn: 无法解析{0}变量{1}：{2}的文字。

# LiteralParseError2
source: Failed to parse the literal {0}.
ru: Не удалось проанализировать литерал {0}.
zh_cn: 解析文字{0}失败。

# MainFunctionCaption
source: Main function name
ru: Имя главной функции
zh_cn: 主要功能名称

# MainFunctionTooltip
source: Specify the name of the main function if it is not "main()".
ru: Укажите название основной функции, если оно не является «main ()».
zh_cn: 如果不是“ main（）”，则指定主函数的名称。

# MappingFileNotFoundString
source: Mapping file not found at {0}.
ru: Файл сопоставления не найден в {0}.
zh_cn: 在{0}找不到映射文件。

# NotAHexCharError
source: The character {0} is not a valid hexadecimal character.
ru: Символ {0} не является допустимым шестнадцатеричным символом.
zh_cn: 字符{0}不是有效的十六进制字符。

# OnlyCnfOutputCaption
source: CNF output only
ru: Только выход CNF
zh_cn: 仅CNF输出

# OnlyCnfOutputTooltip
source: Only translate ANSI-C code to CNF and encode the selected attack; do not solve with the SAT solver.
ru: Переводить только код ANSI-C в CNF и кодировать выбранную атаку; не решайте с решателем SAT.
zh_cn: 仅将ANSI-C代码转换为CNF并对选定的攻击进行编码；不要用SAT求解器求解。

# OutputBitsError
source: Error retrieving output bits.
ru: Ошибка получения выходных битов.
zh_cn: 检索输出位时出错。

# OutputMappingError
source: Error retrieving outuput mapping.
ru: Ошибка получения отображения вывода.
zh_cn: 检索输出映射时出错。

# OutputSizeError
source: Ensure the specified output has the correct length{0}Hash value / ciphertext: {1} bits{0}Output: {2} bits.
ru: Убедитесь, что указанный вывод имеет правильную длину {0} Хэш-значение / зашифрованный текст: {1} бит {0} Вывод: {2} бит.
zh_cn: 确保指定的输出具有正确的长度{0}哈希值/密文：{1}位{0}输出：{2}位。

# OutputStreamCaption
source: Output stream
ru: Выходной поток
zh_cn: 输出流

# OutputStreamTooltip
source: Writes status information and the result of the attack, if the attack was successful.
ru: Записывает информацию о статусе и результат атаки, если атака прошла успешно.
zh_cn: 如果攻击成功，则写入状态信息和攻击结果。

# PlaintextCaption
source: Plaintext
ru: Простой текст
zh_cn: 纯文本

# PlaintextEncodingError
source: Encoding of the plaintext bits returned with an error.
ru: Кодирование битов открытого текста, возвращаемых с ошибкой.
zh_cn: 错误返回的明文位的编码。

# PlaintextPrefixInfoString
source: Ensure that the provided plaintext has the prefix "0x" or "0b".
ru: Убедитесь, что предоставленный открытый текст имеет префикс «0x» или «0b».
zh_cn: 确保提供的明文具有前缀“ 0x”或“ 0b”。

# PlaintextSizeError
source: Ensure the specified plaintext has the correct length (the amount of input bits must be larger than the amount of plaintext bits){0}Plaintext: {1} bits{0}Input: {2} bits.
ru: Убедитесь, что указанный открытый текст имеет правильную длину (количество входных бит должно быть больше количества бит открытого текста) {0} Обычный текст: {1} бит {0} Вход: {2} бит.
zh_cn: 确保指定的明文具有正确的长度（输入位数必须大于明文位数）{0}明文：{1}位{0}输入：{2}位。

# PlaintextTooltip
source: Enter the plaintext.
ru: Введите открытый текст.
zh_cn: 输入明文。

# PluginCaption
source: SAT Attack
ru: Атака SAT
zh_cn: SAT攻击

# PluginDescription
source: A tool for SAT-based cryptanalysis
ru: Инструмент для криптоанализа на основе SAT
zh_cn: 基于SAT的密码分析工具

# PrefixError
source: Use the prefix "0x" for hexadecimal value or the prefix "0b" for binary value.
ru: Используйте префикс «0x» для шестнадцатеричного значения или префикс «0b» для двоичного значения.
zh_cn: 十六进制值使用前缀“ 0x”，二进制值使用前缀“ 0b”。

source: Preimage attack
ru: Активация префикса
zh_cn: 图像前攻击

source: Preimage attack options
ru: Опции префиксной атаки
zh_cn: 映像前攻击选项

# SatOutputProcessError
source: Processing of SAT solver output returned an error.
ru: Обработка выходного сигнала SAT возвратила ошибку.
zh_cn: SAT求解器输出的处理返回错误。

# SatProcessKillException
source: Killing SAT solver process threw an exception: {0} {1}.
ru: Завершение исключения Killing SAT привело к исключению: {0} {1}.
zh_cn: 终止SAT解算器进程引发异常：{0} {1}。

# SatProcessKillSuccess
source: Successfully killed SAT solver process.
ru: Успешно убил процесс решателя SAT.
zh_cn: 成功终止了SAT求解器过程。

# SatProcessReturnedSuccessful
source: SAT solver process returned successfully after {0} seconds.
ru: Процесс решения SAT успешно вернулся после {0} секунд.
zh_cn: {0}秒后，SAT解算器过程成功返回。

# SatProcessReturnedUnsat
source: SAT solver process returned after {0} seconds... but failed to find a solution.
ru: Процесс SAT-решения был возвращен после {0} секунд ... но не нашел решения.
zh_cn: SAT求解器进程在{0}秒后返回了...但是找不到解决方案。

# SatSolverOutputFileError
source: SAT solver output file not found at {0}.
ru: Выходной файл разрешения SAT не найден в {0}.
zh_cn: 在{0}找不到SAT求解器输出文件。

# SatSolverOutputFirstLineError
source: First line in SAT solver output file {0} is not "SAT".
ru: Первая строка в выходном файле решателя SAT {0} не является «SAT».
zh_cn: SAT求解器输出文件{0}中的第一行不是“ SAT”。

# SatSolverOutputStreamCaption
source: SAT solver
ru: Решения SAT
zh_cn: SAT求解器

# SatSolverOutputStreamTooltip
source: Redirect the output of the SAT solver process.
ru: Перенаправить вывод процесса SAT-решателя.
zh_cn: 重定向SAT求解器过程的输出。

# SatSolverReturnedWithExitcode
source: SAT solver process returned with exitcode {0}.
ru: Процесс SAT-решения, возвращаемый с помощью exitcode {0}.
zh_cn: SAT解算器进程以退出代码{0}返回。

source: Second preimage attack
ru: Вторая предваряющая атака
zh_cn: 第二次原像攻击

source: Second preimage attack options
ru: Опции второй префиксной атаки
zh_cn: 第二次原像攻击选项

# SecondPreimageEncodingError
source: Encoding of the second preimage bits returned with an error.
ru: Кодирование битов второго префикса, возвращаемых с ошибкой.
zh_cn: 返回的第二原像位的编码有错误。

# SecondPreimageEncodingString
source: Encoding first preimage in CNF…
ru: Кодирование первого прообраза в CNF ...
zh_cn: 在CNF中编码第一个原像…

# SecondPreimageRetrievingError
source: Error retrieving second preimage bits.
ru: Ошибка получения вторых битов прообраза.
zh_cn: 检索第二原像位时出错。

# SecondPreimageSizeError
source: Ensure the specified second preimage has the correct length{0}Second preimage: {1} bits{0}Input: {2} bits.
ru: Убедитесь, что указанный второй прообраз имеет правильную длину {0} Второй прообраз: {1} бит {0} Вход: {2} бит.
zh_cn: 确保指定的第二原像具有正确的长度{0}第二原像：{1}位{0}输入：{2}位。

# SkippingSatSolverString
source: Skipping SAT solver process…
ru: Пропуск процесса SAT-решения ...
zh_cn: 跳过SAT求解器过程…

# SuccessfulString
source: successful
ru: успешный
zh_cn: 成功的

# UnassignedVariableWarning
source: Variable {0}_{1}:{2} does not appear in the {3} mapping. Is the Variable {0}_{1} used in the ANSI-C code? It will be assigned "false" by default.
ru: Переменная {0} _ {1}: {2} не отображается в отображении {3}. Используется ли переменная {0} _ {1} в коде ANSI-C? По умолчанию ему будет присвоено значение «false».
zh_cn: 变量{0} _ {1}：{2}未出现在{3}映射中。 ANSI-C代码中是否使用了变量{0} _ {1}？默认情况下，它将被分配为“ false”。

# VariableDefinitionsError
source: Make sure the {0} variable definitions start with {1}_0 and the indices are incremented steadily and each variable is actually used in the code.
ru: Убедитесь, что определения переменных {0} начинаются с {1} _0, и индексы постоянно растут, и каждая переменная фактически используется в коде.
zh_cn: 确保{0}变量定义以{1} _0开头，并且索引稳定增加，并且每个变量都在代码中实际使用。

# VariableIndexParseError
source: Failed to parse the variable index for {0} variable {1}:{2}.
ru: Не удалось проанализировать индекс переменной для переменной {0} {1}: {2}.
zh_cn: 无法解析{0}变量{1}：{2}的变量索引。

# VariableNumberParsingFailedString
source: Failed to read number of {0} variables.
ru: Не удалось прочитать число переменных {0}.
zh_cn: 无法读取{0}个变量。

# VariableSizeParsingFailedString
source: Failed to read size of {0} variables.
ru: Не удалось прочитать размер переменных {0}.
zh_cn: 无法读取{0}变量的大小。

# InputFoundStringKeyRecovery
source: Key-recovery attack: A key was found that fits to the provided plaintext and ciphertext:
ru: Атака с помощью ключа: найден ключ, который соответствует предоставленному открытому тексту и зашифрованному тексту:
zh_cn: 密钥恢复攻击：找到了一个适合提供的明文和密文的密钥：

# InputFoundStringPreimage
source: Preimage attack: An input was found that fits to the provided hash value:
ru: Атака с префиксом: был найден вход, который соответствует предоставленному хеш-значению:
zh_cn: 映像前攻击：找到一个适合提供的哈希值的输入：

# InputFoundStringSecondPreimage
source: Second preimage attack: An input was found that fits to the provided hash value and is different from the provided first preimage:
ru: Вторая атака на прообраз: был найден вход, который соответствует предоставленному хеш-значению и отличается от предоставленного первого прообраза:
zh_cn: 第二次原图像攻击：找到一个适合提供的哈希值且与提供的第一个原图像不同的输入：

# TimeFormat
source: s'.'fff
ru: s&#39;. &#39;FFF

# CbmcExeNotFound
source: Could not find the cbmc executable at {0}.
ru: Не удалось найти исполняемый файл cbmc в {0}.
zh_cn: 在{0}处找不到cbmc可执行文件。

# satSolverExeNotFound
source: Could not find the SAT solver executable at {0}.
ru: Не удалось найти исполняемый файл SAT-solver в {0}.
zh_cn: 在{0}找不到SAT解算器可执行文件。
