Repository: JarLob/CrypTool2
Catalog: CrypPluginsExperimental/DCAPathFinder/Properties/Resources.*.resx
Languages: de

# BtnSkipChapter
source: Skip chapter
de: Kapitel überspringen

# ChoiceOfAlgorithm
source: Choice of the cipher
de: Wahl des Algorithmus

# ChoiceOfAlgorithmToolTop
source: At this point one of the ciphers contained in the list can be selected. This cipher can be examined by differential cryptanalysis.
de: An dieser Stelle kann einer der in der Liste enthaltenen Algorithmen ausgewählt werden. Dieser kann mittels differenzieller Kryptoanalyse untersucht werden.

# Cipher1
source: Tutorial 1: Cipher 1 (16 bit blocksize, 2 subkeys, keylength is 32 bit)
de: Chiffre 1: 16 Bit Blockgröße, 2 Rundenschlüssel, der Schlüssel ist 32 Bit groß

# Cipher2
source: Tutorial 2: Cipher 2 (16 bit blocksize, 4 subkeys, keylength is 64 bit)
de: Chiffre 2: 16 Bit Blockgröße, 4 Rundenschlüssel, der Schlüssel ist 64 Bit groß

# Cipher3
source: Tutorial 3: Cipher 3 (16 bit blocksize, 6 subkeys, keylength is 96 bit)
de: Chiffre 3: 16 Bit Blockgröße, 6 Rundenschlüssel, der Schlüssel ist 96 Bit groß

# Cipher4
source: Tutorial 4: Cipher 4 (4 bit blocksize, 4 subkeys, keylength is16 bit)
de: Chiffre 4: 4 Bit Blockgröße , 4 Rundenschlüssel, der Schlüssel ist 16 Bit groß

# DescriptionContent1
source: The following is a short description of the ciphers of the individual parts of the tutorial:
de: In den Einstellungen dieser Komponente können Sie zwischen den Tutorials wechseln. Es folgt eine kurze Beschreibung der Chiffren der einzelnen Teile des Tutorials:

# DescriptionContent2
source: Tutorial 1 uses cipher 1 of the ToyChiffren component. This cipher works on 16 bit blocks and uses two round keys. One encryption round is executed. In this tutorial two unknown 16 bit round keys are restored.
de: Tutorial 1 verwendet Chiffre 1 der ToyChiffren-Komponente. Diese Chiffre arbeitet auf 16 Bit Blöcken und verwendet zwei Rundenschlüssel. Es wird eine Verschlüsselungsrunde ausgeführt. In diesem Tutorial werden zwei unbekannte, je 16 Bit große Rundenschlüssel wiederhergestellt.

# DescriptionContent3
source: Tutorial 2 uses cipher 2 of the ToyChiffren component. This cipher works on 16 bit blocks and uses four round keys. Three encryption rounds are executed. In this tutorial four unknown 16 bit roundkeys are restored.
de: Tutorial 2 verwendet Chiffre 2 der ToyChiffren-Komponente. Diese Chiffre arbeitet auf 16 Bit Blöcken und verwendet vier Rundenschlüssel. Es werden drei Verschlüsselungsrunden ausgeführt. In diesem Tutorial werden vier unbekannte, je 16 Bit große Rundenschlüssel wiederhergestellt.

# DescriptionContent4
source: Tutorial 3 uses cipher 3 of the ToyChiffren component. This cipher works on 16 bit blocks and uses six round keys. Five encryption rounds are executed. In this tutorial six unknown 16 bit round keys are restored.
de: Tutorial 3 verwendet Chiffre 3 der ToyChiffren-Komponente. Diese Chiffre arbeitet auf 16 Bit Blöcken und verwendet sechs Rundenschlüssel. Es werden fünf Verschlüsselungsrunden ausgeführt. In diesem Tutorial werden sechs unbekannte, je 16 Bit große Rundenschlüssel wiederhergestellt.

# DescriptionHeader
source: Description of the tutorials
de: Beschreibung der Tutorials

# DifferentialCryptanalysisHeader
source: 2. Differential cryptanalysis of cipher 1
de: 2. Differenzielle Kryptoanalyse von Chiffre 1

# DifferentialCryptanalysisSlide1Content1
source: At this point we apply the idea of differential cryptanalysis to cipher 1. The structure of a cipher is usually public, so that all components and their functionality are known. The security of a cipher should never be based on the secrecy of the construction, but on the secrecy of the key. This requirement is also called Kerckhoffs' principle.
de: An dieser Stelle wenden wir die Idee der differenziellen Kryptoanalyse auf Chiffre 1 an. Der Aufbau einer Chiffre ist in aller Regel öffentlich, sodass alle Bestandteile und deren Funktionsweise bekannt sind. Die Sicherheit einer Chiffre sollte niemals auf Geheimhaltung der Konstruktion basieren, sondern auf der Geheimhaltung des Schlüssels. Diese Forderung wird auch Kerckhoffs’ Prinzip genannt.

# DifferentialCryptanalysisSlide1Content3
source: Subsequently, a substitution by the SBoxes takes place:
de: Anschließend erfolgt eine Substitution durch die SBoxen:

# DifferentialCryptanalysisSlide1Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1

# DifferentialCryptanalysisSlide2Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1

# DifferentialCryptanalysisSlide3Content1
source: The following figure summarizes the encryption process as outlined above:
de: Die folgende Abbildung fasst den Verschlüsselungsprozess, wie zuvor skizziert, zusammen:

# DifferentialCryptanalysisSlide3Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1

# ExpectedDifferential
source: Expected difference
de: Erwartete Differenz

# ExpectedDifferentialToolTip
source: This difference describes the expected value that should occur with a high probability at the previously specified position ( round, SBox).
de: Diese Differenz beschreibt den Erwartungswert, der an der zuvor spezifizierten Stelle (Runde, SBox) mit hoher Wahrscheinlichkeit auftreten soll

# IntroductionHeader
source: 1. IntroductionHeader
de: 1. Einführung

# IntroductionSlide1Content1
source: In this section we consider the basic idea of differential cryptanalysis. Many symmetric round-based block ciphers consist of three basic operations: Key addition, substitution and permutation. In this section, we limit ourselves to key addition and substitution.
de: In diesem Abschnitt betrachten wir die Grundidee der differenziellen Kryptoanalyse. Viele symmetrische rundenbasierte Blockchiffren bestehen aus drei grundlegenden Operationen: Schlüsseladdition, Substitution und Permutation. In diesem Abschnitt beschränken wir uns zunächst auf Schlüsseladdition und Substitution.

# IntroductionSlide1Content2
source: Many ciphers use the XOR operation (exclusive-OR) for key addition. The XOR operation is a two-digit operator that can be described by the following value table:
de: Bei der Schlüsseladdition verwenden sehr viele Chiffren die XOR-Operation (Exklusiv-Oder). Die XOR-Operation ist ein zweistelliger-Operator, der durch folgende Wertetabelle beschrieben werden kann:

# IntroductionSlide1DataColHeader1
source: Inputbit A
de: Eingabebit A

# IntroductionSlide1DataColHeader2
source: Inputbit B
de: Eingabebit B

# IntroductionSlide1DataColHeader3
source: Resultbit
de: Ergebnisbit

# IntroductionSlide1Header
source: Introduction
de: Einführung

# IntroductionSlide2Content1
source: If the XOR operation is performed with a message m and key k, the ciphertext is generated:
de: Wird die XOR-Operation mit einer Nachricht m und Schlüssel k durchgeführt, erhält man den Schlüsseltext:

# IntroductionSlide2Content2
source: The core idea of differential cryptanalysis is now to use the key twice. Let's look at the impact at this point:
de: Die Grundidee der differenziellen Kryptoanalyse ist es nun, dass der Schlüssel zweimal verwendet wird. Wir betrachten an dieser Stelle die Auswirkung:

# IntroductionSlide2Content3
source: We get back the original message m. The XOR operation is often referred to as the difference operator. This is what we will do in this tutorial.
de: Wir erhalten wieder die ursprüngliche Nachricht m. Der XOR-Operator wird häufig auch als Differenz-Operator bezeichnet. Diese Benennung nutzen wir in diesem Tutorial auch.

# IntroductionSlide2Content4
source: In reality, ciphers are more extensive, more complicated and do not consist exclusively of key additions. The differential cryptanalysis is a so called "chosen plaintext attack", which means the cryptanalyst can select plaintext messages and encrypt them to have matching plaintext/ciphertext pairs.
de: In der Realität sind Chiffren umfangreicher, komplizierter und bestehen nicht ausschließlich aus Schlüsseladditionen. Die differenzielle Kryptoanalyse ist ein so genannter "Chosen Plaintext-Angriff", das bedeutet der Kryptoanalyst kann Klartext-Nachrichten auswählen und diese verschlüsseln lassen, so dass er passende Klartext-/Geheimtext-Paare hat.

# IntroductionSlide2Header
source: Introduction
de: Einführung

# IntroductionSlide3Content1
source: We take advantage of the idea of using the key twice by looking at pairs of messages. Then the following can be calculated:
de: Die Idee des zweimaligen Anwenden des Schlüssels nutzen wir, indem wir Paare von Nachrichten betrachen. Dann kann folgendes berechnet werden:

# IntroductionSlide3Content2
source: It is valid:
de: Nun gilt:

# IntroductionSlide3Content3
source: In words, we get the difference of the plain texts by calculating the difference of the key texts.
de: In Worten, wir erhalten die Differenz der Klartexte durch Berechnung der Differenz der Schlüsseltexte.

# IntroductionSlide3Header
source: Introduction
de: Einführung

# MessageCount
source: Count of messages
de: Nachrichtenanzahl

# MessageCountToolTip
source: Number of messages the oracle should generate
de: Anzahl an Nachrichten, die das Orakel generieren soll

# OverviewContent1
source: Welcome to the differential cryptanalysis tutorial. This method for the analysis of round-based symmetric block ciphers aims at recovering single bits up to complete round keys. This method was published in 1991 by the two Israeli researchers, Eli Biham and Adi Shamir.
de: Herzlich willkommen zum Tutorial zur differenziellen Kryptoanalyse. Dieses Verfahren zur Analyse rundenbasierter symmetrischer Blockchiffren hat das Ziel, einzelne Bits bis hin zu vollständigen Rundenschlüsseln wiederherzustellen. Veröffentlicht wurde dieses Verfahren 1991 von den zwei israelischen Forschern Eli Biham und Adi Shamir.

# OverviewContent2
source: This tutorial describes the differential cryptanalysis (DCA) procedure in three parts. Part 1 explains the basic idea of DCA using a cipher with one encryption round. Part 2 deepens this idea using a cipher with three encryption rounds. Part three deepens the knowledge by increasing the complexity of the cipher to 5 encryption rounds. In part three the knowledge is deepened by increasing the complexity of the cipher to 5 encryption rounds.
de: Dieses Tutorial handelt das DCA-Verfahren in drei Teilen. Teil 1 vermittelt die grundlegende Idee der differenziellen Kryptoanalyse (DCA) anhand einer Chiffre mit einer Verschlüsselungsrunde. Teil 2 vertieft diese Idee anhand einer Chiffre mit drei Verschlüsselungsrunden. In Teil drei wird das vermittelte Wissen vertieft durch Erhöhung der Komplexität der Chiffre auf 5 Verschlüsselungsrunden.

# OverviewContent3
source: In the configuration of this component the different parts of the tutorial can be selected.
de: In der Konfiguration dieser Komponente können die verschiedenen Teile des Tutorials ausgewählt werden.

# OverviewContent4
source: Have fun trying out and breaking the ciphers!
de: Viel Spaß beim Ausprobieren und Brechen der Chiffren!

# OverviewContent5
source: (This introduction can be skipped by starting the workspace)
de: (Diese Einführung kann durch Starten des Workspaces übersprungen werden)

# OverviewHeader
source: Differential Cryptanalysis Tutorial
de: Tutorial zur differenziellen Kryptoanalyse

# Path
source: Path of the characteristic
de: Pfad der Charakteristik

# PathToolTip
source: These values describe the flow of the difference values through a cipher.
de: Diese Werte beschreiben den Fluss der Differenzwerte durch eine Chiffre.

# PluginCaption
source: DCA PathFinder
de: DCA PfadFinder

# PluginTooltip
source: The DCA PathFinder component searches for differentials in a symmetric block cipher depending on parameters specified by the user.
de: Die DCA PfadFinder-Komponente sucht in Abhängigkeit von durch den User spezifizierten Parametern nach Differenzialen in einer symmetrischen Blockchiffre.

# StartMaskContent1
source: The tutorial starts when you start the workspace.
de: Durch Starten des Workspaces beginnt das Tutorial.

# StartMaskContent2
source: You have currently selected Tutorial {0}.
de: Momentan haben Sie Tutorial {0} ausgwählt.

# StartMaskHeader
source: Ready for execution
de: Bereit zur Ausführung

# TitleHeader
source: Tutorial differential cryptanalysis of symmetric block ciphers
de: Tutorial Differenzielle Kryptoanalyse symmetrischer Blockchiffren
