Repository: JarLob/CrypTool2
Catalog: CrypPluginsExperimental/EncryptedVM/Properties/Resources.*.resx
Languages: de

# EncryptedVM_Assemblerr_Log_Tooltip
source: Assembling log
de: Assemblierungsprotokoll

# EncryptedVM_Assembler_Log_Name
source: Log
de: Protokoll

# EncryptedVM_Assembler_Mode_Name
source: Load from file
de: Aus Datei laden

# EncryptedVM_Assembler_Mode_Tooltip
source: Whether to load the source code from a file or not
de: Ob der Quelltext aus einer Datei geladen werden soll

# EncryptedVM_Assembler_Program_Name
source: Program
de: Programm

# EncryptedVM_Assembler_Program_Tooltip
source: Assembled program
de: Assembliertes Programm

# EncryptedVM_Assembler_SourceCode_Name
source: Source code
de: Quelltext

# EncryptedVM_Assembler_SourceCode_Tooltip
source: Source code to assemble
de: Zu assemblierender Quelltext

# EncryptedVM_Assembler_SourcePath_Name
source: Source code path
de: Quelltextpfad

# EncryptedVM_Assembler_SourcePath_Tooltip
source: Path to file containing the source code
de: Pfad zur Datei die den Quelltext enthält

# EncryptedVM_Assembler_Tooltip
source: Assemble a program for an encrypted virtual machine
de: Assembliert ein Programm für die verschlüsselte virtuelle Maschine

# EncryptedVM_Keygen_KeySize_Name
source: Power of Poly Modulus (Key size)
de: Grad des Poly-Modulos (Schlüsselgröße)

# EncryptedVM_Keygen_KeySize_Tooltip
source: The power of the polynomial modulus
de: Der Grad des polynomiellen Modulos

# EncryptedVM_Keygen_Mode_Name
source: Encrypt
de: Mit Verschlüsselung

# EncryptedVM_Keygen_Mode_Tooltip
source: Whether to encrypt the program or not
de: Ob das Programm verschlüsselt werden soll

# EncryptedVM_Keygen_Name
source: EncryptedVM Keygen
de: EncryptedVM Schlüsselgenerator

# EncryptedVM_Keygen_Tooltip
source: Generate keys for an encrypted virtual machine
de: Generiert Schlüssel für die verschlüsselte virtuelle Maschine

# EncryptedVM_Machine_Cycles_Name
source: Cycles
de: Zyklen

# EncryptedVM_Machine_Cycles_Tooltip
source: Number of cycles
de: Anzahl der Zyklen

# EncryptedVM_Machine_Name
source: EncryptedVM Machine
de: EncryptedVM Maschine

# EncryptedVM_Machine_Tooltip
source: Virtual encrypted machine
de: Verschlüsselte virtuelle Maschine

# EncryptedVM_MemoryDisplay_Name
source: EncryptedVM Memory Display
de: EncryptedVM Speicheranzeige

# EncryptedVM_MemoryDisplay_Tooltip
source: Decrypt the memory of an EncryptedVM machine
de: Entschlüssele den Speicher einer EncryptedVM Maschine

# EncryptedVM_Memory_Decrypted_Name
source: Decrypted Memory
de: Entschlüsselter Speicher

# EncryptedVM_Memory_Decrypted_Tooltip
source: The decrypted memory of the machine (or parts of it)
de: Der entschlüsselter Speicher der Maschine (oder Teile dessen)

# EncryptedVM_Memory_Encrypted_Name
source: Encrypted Memory
de: Verschlüsselter Speicher

# EncryptedVM_Memory_Encrypted_Tooltip
source: The encrypted memory of the machine
de: Der verschlüsselte Speicher der Maschine

# EncryptedVM_Memory_Rows_Name
source: Rows
de: Reihen

# EncryptedVM_Memory_Rows_Tooltip
source: Number of rows to decrypt
de: Anzahl der zu entschlüsselnden Reihen

# EncryptionParameters_Name
source: Parameters
de: Parameter

# EncryptionParameters_Tooltip
source: Parameters for Encoding/Encrypting/Decrypting/Decoding
de: Parameter zum Kodieren/Verschlüsseln/Entschlüsseln/Dekodieren

# EvaluationKeys_Name
source: Evaluation Keys
de: Evaluationsschlüssel

# EvaluationKeys_Tooltip
source: Keys to perform operations on encrypted data
de: Schlüssel zur Berechnung von Daten

# PublicKey_Name
source: Public Key
de: Öffentlicher Schlüssel

# PublicKey_Tooltip
source: Key to encrypt data
de: Schlüssel zum Verschlüsseln von Daten

# SecretKey_Name
source: Secret Key
de: Geheimer Schlüssel

# SecretKey_Tooltip
source: Key to decrypt data
de: Schlüssel zum Entschlüsseln von Daten

# Ac_specified_multiple_times
source: AC specified multiple times, using first occurence (line: {0})
de: AC mehrfach definiert; erste Definiton wird verwendet (line: {0})

# Failed_to_read_source_code_file
source: Failed to read source code from \"{0}\"
de: Quelltext konnte nicht von \"{0}\" geladen werden

# Invalid_program_no_code
source: Invalid Program (contains no code)
de: Invalides Programm (enthält keine Instruktionen)

source: Invalid Program (too much code)
de: Invalides Programm (enthält zuviele Instruktionen)

# Invalid_syntax
source: Invalid Syntax (line: {0}, command: {1})
de: Invalider Syntax (linie: {0}, kommando: {1})

# Label_not_found
source: Label \"{0}\" not found (line: {1}, command: {2})
de: Bezeichner \"{0}\" nicht gefunden (linie: {0}, kommando: {1})

# Label_used_multiple_times
source: Label \"{0}\" used multiple times (line: {1}, command: {2})
de: Bezeichner \"{0}\" mehrfach deklariert (linie: {0}, kommando: {1})

# No_ac_defined
source: No AC defined (line: {0})
de: Kein AC definiert (linie: {0})

# No_pc_defined
source: No PC defined (line: {0})
de: Kein PC definiert (linie: {0})

# Pc_label_not_found
source: Label \"{0}\" not found (line: {1})
de: Bezeichner \"{0}\" nicht gefunden (linie: {1})

# Pc_specified_multiple_times
source: PC specified multiple times, using first occurence (line: {0})
de: PC mehrfach definiert; erste Definiton wird verwendet (line: {0})

# EncryptedVM_Machine_Output_Name
source: Result
de: Ergebnis

# EncryptedVM_Machine_Output_Tooltip
source: Result of the program
de: Ergebnis des Programmes

source: -> DUMP-END <-
de: -> SPEICHERABBILD-ENDE <-

source: -> DUMP_START <-
de: -> SPEICHERABBILD-BEGINN <-

# End_Cycle
source: -> END-PROCESS-CYCLE <-
de: -> PROZESS-ZYKLUS-ENDE <-

source: Executing Program...
de: Programm wird ausgeführt...

# Failed_loading_program
source: Failed to load program
de: Laden des Programmes fehlgeschlagen

source: ...Finished executing program
de: ...Ausführung des Programmes beendet

source: Init Machine...
de: Initialisierung der Maschine...

source: Loading Program...
de: Lade Programm...

# Phase_1
source: PHASE 1: Fetch
de: PHASE 1: Holen

# Phase_2
source: PHASE 2: Decode
de: PHASE 2: Dekodieren

# Phase_3
source: PHASE 3: Execute
de: PHASE 3: Ausführen

# Phase_4
source: PHASE 4: Load / Store
de: PHASE 4: Laden / Speichern

# Phase_5
source: PHASE 5: Rewrite registers / flags
de: PHASE 5: Register / Statusindikator neu schreiben

# Start_Cycle
source: -> START-PROCESS-CYCLE <-
de: -> PROZESS-ZYKLUS-BEGINN <-

# EncryptedVM_Memory_Mode_Name
source: Run selection algorithm
de: Selektierungsalgorithmus nutzen

# EncryptedVM_Memory_Mode_Tooltip
source: Whether to display rows of the memory or the selection made by the program
de: Ob die Reihen des Speichers oder die Selektion des Programms angezeigt werden soll

# EncryptedVM_Memory_Program_Name
source: Memory display program
de: Speicheranzeigeprogramm

# EncryptedVM_Memory_Program_Tooltip
source: Program to display the content of the memory
de: Programm zum Anzeigen des Speichers
